JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
/*******************************************************************
*文件名称:  STM32FAds1248Driver.c
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*作    者: 
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/


/******************************************************************
*                             头文件                              *
******************************************************************/
#include "STM32FAds1248Driver.h"
#include "stm32f0xx_dma.h"
#include "STM32F0Ads8331Driver.h"
#include "stm32f0xx_conf.h"
#include "Iocontrol.h"
#include "STM32F0usartopt.h"

#if TEMPERATURE_MODULE_CODE

/******************************************************************
*                            常量                                 *
******************************************************************/

/******************************************************************
*                           宏定义                                *
******************************************************************/

/******************************************************************
*                           数据类型                              *
******************************************************************/
#define ADSCOMPENSATIONDATA  8388608
#define ADSREFERENCEVOLTAGE  2500
#define INDEXINGTABLEADDENDFACTOR   1000000000
#define INDEXINGTABLEMULTIFACTOR    1000

#define  PRECISION_MAGNIFICATION    100000
#define  PRECISION_MAGNIFICATION_1000  1000
#define  PRECISION_MAGNIFICATION_10    10

#define  MCUREFERENCEVOLTAGE  1225
#define  VOLTAGE   33000000
/*冷端补偿转换系数*/
#define  COLDENDVOLTAGE    2048//3291
#define  RESOLUTIONBITLENGTH_12   12
#define  TABLETYPELENGTH   12
#define  DMA_BUFFER_LENGTH   16


#define FSCBYTELENGTH       5
#define GAINBYTELENGTH      3

#define  TYPE_B_FSC_CMD           0x47020000
#define  TYPE_B_SYS_CMD           0x40430079


#define  TYPE_K_FSC_CMD        0x00000247  
#define  TYPE_K_SYS_CMD        0x59004340   

#define CHANNELCFGLENGTH    3

#define RDATACMD         0xffffff12     
#define RDATACMDLENGTH      4


#define DATARADYPORT       GPIOA
#define DRDAYPIN           GPIO_Pin_2


#define  WRITECMD                 0x40
#define  WRITEBYTENUM             0x00

#define  CMD_VALUE_0       0x01
#define  CMD_VALUE_2       0x25
#define  CMD_VALUE_4       0x37
#define  CMD_VALUE_6       0x13

#define FSCANDPGAVALUE_0   0x47
#define FSCANDPGAVALUE_1   0x00
#define FSCANDPGAVALUE_2   0x00
#define FSCANDPGAVALUE_3   0x48
#define FSCANDPGAVALUE_4   0x00
#define FSCANDPGAVALUE_5   0x00
#define FSCANDPGAVALUE_6   0x49
#define FSCANDPGAVALUE_7   0x00
#define FSCANDPGAVALUE_8   0x40
#define FSCANDPGAVALUE_9   0x43
#define FSCANDPGAVALUE_10  0x00
#define FSCANDPGAVALUE_32  0x55
#define FSCANDPGAVALUE_64  0x69
#define FSCANDPGAVALUE_128  0x79

#define VBIASCMD   0x41
#define VBIASVALUE  0xaa
#define FSCANDPGALENGTH   18

/*新增FR3924使用的宏*/
#if (IO_CODE_TYPE == FR3924_CODE)
#define READDATATIMES         27//8//16
#define READDATATIMES_COMPENSATION         5//16


#define REFSELT_VALUE   0x30

#define  RTU_USER_CHANNEL_1         0x37
#define  RTU_USER_CHANNEL_2         0x1a
#define  RTU_USER_CHANNEL_3         0x37
#define  RTU_USER_CHANNEL_4         0x1a

#define GPIO_MODE   0x03
#define GPIO_OUT    0x00


/*GPIO1-GPIO0: 01*/
#define  RTU_USER_GPIO_SWITCH_1    0x01
/*GPIO1-GPIO0: 10*/
#define  RTU_USER_GPIO_SWITCH_2    0x02

#define RTU_USER_INIT_PARA_LEN      30
#define RTU_USER_VBIAS_VALUE         0x84

#define  RTU_COMPENSATION_CHANNEL_1   0x05
#define  RTU_COMPENSATION_CHANNEL_2   0x0D
#define  RTU_COMPENSATION_CHANNEL_3   0x0D
#define  RTU_COMPENSATION_CHANNEL_4   0x25

#define TMEPERATURE_CHANNEL_0    0
#define COMPENSATION_CHANNEL_0   1

#define TMEPERATURE_CHANNEL_1    2
#define COMPENSATION_CHANNEL_1   3

#define TMEPERATURE_CHANNEL_2    4
#define COMPENSATION_CHANNEL_2   5

#define TMEPERATURE_CHANNEL_3    6
#define COMPENSATION_CHANNEL_3   7

#define RTU_PGA_128_RATE_160     0x77  
#define RTU_PGA_64_RATE_160      0x67  
#define RTU_PGA_32_RATE_160      0x57  
#define RTU_PGA_16_RATE_160      0x47  
#define RTU_PGA_1_RATE_160       0x07

#define RTU_CHANNEL_CONFIG_LEN     9
#define RTU_CHANNEL_CONFIG_NO_GPIO_LEN     6
#define RTU_COMPENSATION_CONFIG_LEN  6

#define RTU_SAMPLE_REFVOLTAGE     2048
#define  RESOLUTIONBITLENGTH_23  23

#define TABLE_GAIN_VALUE_10000         10000
#define TABLE_GAIN_VALUE_5000          5000

#define TEMPERATURE_INTERVAL_2          2
#endif

uint8_t sucSampleTimes = 0;    


/******************************************************************
*                         全局变量定义                            *
******************************************************************/
uint8_t gucCurrentIndex= 0;

uint16_t ADS_DMA_RXBUFFER[DMA_BUFFER_LENGTH] = {0};

extern int16_t gusaAnalogData[MAX_AI_CHANNEL_NUMBER];

int32_t giaSPIAIFilterHandleBuffer[SPI_AI_RXBUFFER_SIZE];
extern AISampleInfo_t gtaAISampleInfo[MAX_AI_CHANNEL_NUMBER];
extern  int16_t gsaVlotageSample[MCUSAMPLETIMES];
extern  uint8_t SPI_AI_RxBuffer[SPI_AI_RXBUFFER_SIZE]; 
extern  uint8_t SPI_AI_TxBuffer[SPI_AI_TXBUFFER_SIZE];
extern  uint8_t gucChannelCount;
/*分度表的起始地址*/
uint32_t guiTableAddress = 0;
uint32_t guiTableLength = 0;

#if (IO_CODE_TYPE == FR3924_CODE)

/*热敏电阻的地址*/
uint32_t guiThermistorTableAddress = 0;
uint32_t guiThermistorTablelength = 0;

TableInfo_t gtaTableInfo[TABLETYPELENGTH] = 
{
{E_THERMOCOUPLE_TYPE_K, -100, 1370,32,RTU_PGA_32_RATE_160},
{E_THERMOCOUPLE_TYPE_J, -100, 1200,16,RTU_PGA_16_RATE_160},
{E_THERMOCOUPLE_TYPE_T, -100, 400,64,RTU_PGA_64_RATE_160},
{E_THERMOCOUPLE_TYPE_E, -100, 1000,16,RTU_PGA_16_RATE_160},
{E_THERMOCOUPLE_TYPE_N, -100, 1300,32,RTU_PGA_32_RATE_160},
{E_THERMOCOUPLE_TYPE_S, 0, 1700,64,RTU_PGA_64_RATE_160},
{E_THERMOCOUPLE_TYPE_R, 0, 1700,64,RTU_PGA_64_RATE_160},
{E_THERMOCOUPLE_TYPE_B, 600, 1800,128,RTU_PGA_128_RATE_160},
{E_THERMOCOUPLE_TYPE_C, 0, 2320,32,RTU_PGA_32_RATE_160},
{E_THERMISTOR_TYPE, -10, 70,0}
};

#endif
#if  (IO_CODE_TYPE == FR3822_CODE)
#define READDATATIMES         8

#define PGA_1_DATABAUD_160     0x05
#define PGA_4_DATABAUD_160     0x25
#define PGA_8_DATABAUD_160     0x35
#define PGA_16_DATABAUD_160    0x45


#define RTD_VBIAS_VALUE      0x30    /*5,4为正*/
#define RTD_VBIAS_VALUE_NO   0x00
#define RTD_DRIVING_SOURCE_250   0x03   /*激励电源250uA*/      //     0x02   /*激励电源100uA*/
#define RTD_DRIVING_SOURCE_500   0x04
#define RTD_USER_CHANNEL_1   0x01  //0x04  
#define RTD_USER_CHANNEL_2   0x2C  //0x0D   

#define RTD_USER_CHANNEL_1_BURNOUT   0x81//0xC8
#define RTD_USER_CHANNEL_2_BURNOUT   0xAC//0xEC

#define RTD_USER_CHANNEL_SAMPLE_TIMES    2

