JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
#define RTD_USER_CHANNEL_1_REF  0x20
#define RTD_USER_CHANNEL_2_REF  0x28
#define RTD_USER_CHANNEL_1_DRIIVING_SOURCE_1  0x01 //0x04
#define RTD_USER_CHANNEL_1_DRIIVING_SOURCE_2  0x10 //0x40
#define RTD_USER_CHANNEL_2_DRIIVING_SOURCE_1  0x54 //0x15
#define RTD_USER_CHANNEL_2_DRIIVING_SOURCE_2  0x45 //0x51

#define USER_CHANNEL_0     0
#define USER_CHANNEL_1     1

#define RTD_PT100_TABLE_CHANGERULE    1000

#define RTD_PT100_RESISTANCE_REF       1370  //12000
#define RTD_PT100_FULL_SCALE            23

TableInfo_t gtaTableInfo[TABLETYPELENGTH] = 
{
    {E_THERMAL_RESISTANCE_TYPE_PT100, -200, 800,4},
    {E_THERMAL_RESISTANCE_TYPE_PT200, -200, 630,4},
    {E_THERMAL_RESISTANCE_TYPE_PT500, -200, 630,1},
    {E_THERMAL_RESISTANCE_TYPE_PT1000, -50, 300,1},
    {E_THERMAL_RESISTANCE_TYPE_NI120, -79, 309,4},
    {E_THERMAL_RESISTANCE_TYPE_RESISTANCE_MEASUREMENT, 1, 1200,1},
};

DivingSourceInfo_t gaDivingSourceInfo = {0,0,0,0};


#endif

InitStatus_e eInitCompleteFlag = E_INIT_NONE;           


/******************************************************************
*                          局部函数声明                            *
******************************************************************/
#if (IO_CODE_TYPE == FR3924_CODE)
IO_InterfaceResult_e TempConversion(TableType_e ucTypeIn,int32_t *piFilterDataIn);
IO_InterfaceResult_e MCU_TEM_Compensation(int32_t iVoltageIn, int64_t * piTemperatureOut);
void TableLinearFittingReverse(TableLinear_t* ptLinearLinearIn, uint64_t ulLinearValueIn, int32_t* piTableValueOut);
void ChangeVoltageRules(TableType_e ucTypeIn,int64_t* plVoltageInOut);
IO_InterfaceResult_e GetValueFromThermistorTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut);
IO_InterfaceResult_e GetTemperatureFromTable(TableType_e ucTypeIn,int32_t iCheckValueIn,TableLinear_t * ptLinearLinearOut);
IO_InterfaceResult_e GetTemperatureFromTable_Calibration(TableType_e ucTypeIn,int32_t iCheckValueIn,TableLinear_t * ptLinearLinearOut);
IO_InterfaceResult_e SetCalibrationValueByThermocoupleType(TableType_e tTypeIn);
void TemperatureOffsetCalc(TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut);
void TemperatureOffsetCalcForThermistor (TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut);

#endif
IO_InterfaceResult_e GetValueFromTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut);
void ADS1248_StartConvert(void);
void ADS1248_StopConvert(void);
void UpdateDataArea(int64_t* piTableValueIn);
void ADS1248_Delay(uint32_t nCount);
void TableLinearFitting(TableLinear_t* ptLinearLinearIn, int64_t iLinearValueIn, int64_t* piTableValueOut);

#if (IO_CODE_TYPE == FR3822_CODE)
void GetDataToDivingSource(DivingSourceInfo_t *ptDivingSourceOut,int32_t uiFilterDataIn);
IO_InterfaceResult_e TempConversion(TableType_e ucTypeIn, DivingSourceInfo_t *ptDivingSourceIn);
void ChangeVoltageRules(TableType_e ucTypeIn,int64_t *plResistanceInOut);
void TemperatureOffsetCalc(TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut);


#endif
/******************************************************************
*                         全局函数实现                            *
******************************************************************/

/******************************************************************
*                         局部函数实现                            *
******************************************************************/
/******************************************************************
*函数名称:STM32F0Ads1248DriverConfig
*功能描述:配置SPI DMA GPIO等参数
*输入参数:
*输出参数:STM32F0_SPI_AI_DRIVER_ERROR_e
*返回值:函数执行结果
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/23                              
******************************************************************/

STM32F0_SPI_AI_DRIVER_ERROR_e STM32F0Ads1248DriverConfig(TableType_e tTypeIn,SPI_InitTypeDef  *SPI_InitStructure, GPIO_InitTypeDef  *GPIO_InitStructure, 
                                                         GPIO_InitTypeDef  *GPIO_LOWInitStructure, DMA_InitTypeDef  *DMA_RXInitStructure, DMA_InitTypeDef  *DMA_TXInitStructure)
{
     /*判断SPI初始化指针是否为空*/
    if (NULL == SPI_InitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
     /*判断GPIO初始化指针是否为空*/
    if (NULL == GPIO_InitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
    /*判断MOSI初始化指针是否为空*/
    if (NULL == GPIO_LOWInitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
    /*判断DMA接收结构体指针是否为空*/
    if (NULL == DMA_RXInitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
    /*判断DMA发送结构体指针是否为空*/
    if (NULL == DMA_TXInitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }

    /* Enable the SPI periph */
    RCC_APB2PeriphClockCmd(SPI_AI_CLK, ENABLE);
    
    /* Enable the TIM peripheral */
   
    /* Enable the DMA peripheral */
    RCC_AHBPeriphClockCmd(DMA_AI_CLK, ENABLE);
    
    /* Enable TIM DMA trigger clock */ 

    /* Enable SCK, MOSI, MISO and NSS GPIO clocks */
    RCC_AHBPeriphClockCmd(SPI_AI_SCK_GPIO_CLK | SPI_AI_MISO_GPIO_CLK | SPI_AI_MOSI_GPIO_CLK | SPI_AI_NSS_GPIO_CLK | TIM_AI_TRIGGER_GPIO_CLK, ENABLE);

    /*复用管脚配置*/
    GPIO_PinAFConfig(SPI_AI_SCK_GPIO_PORT, SPI_AI_SCK_SOURCE, SPI_AI_SCK_AF);
    GPIO_PinAFConfig(SPI_AI_MOSI_GPIO_PORT, SPI_AI_MOSI_SOURCE, SPI_AI_MOSI_AF);
    GPIO_PinAFConfig(SPI_AI_MISO_GPIO_PORT, SPI_AI_MISO_SOURCE, SPI_AI_MISO_AF);
    GPIO_PinAFConfig(TIM_AI_TRIGGER_GPIO_PORT, TIM_AI_TRIGGER_SOURCE, GPIO_AF_2);

    /*GPIO初始化参数配置*/
    GPIO_InitStructure->GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure->GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure->GPIO_PuPd  = GPIO_PuPd_DOWN;
    GPIO_InitStructure->GPIO_Speed = GPIO_Speed_Level_3;

    /*MOSI初始化参数配置*/
    GPIO_LOWInitStructure->GPIO_Mode = GPIO_Mode_OUT;
    GPIO_LOWInitStructure->GPIO_OType = GPIO_OType_PP;
    GPIO_LOWInitStructure->GPIO_PuPd  = GPIO_PuPd_UP;
    GPIO_LOWInitStructure->GPIO_Speed = GPIO_Speed_Level_3;
    /*配置START引脚PB9*/
    GPIO_LOWInitStructure->GPIO_Pin = ADS_START_CONTROL_PIN;
    GPIO_Init(ADS_START_GPIO_PORT, GPIO_LOWInitStructure);

    /* SPI SCK pin configuration */
    GPIO_InitStructure->GPIO_Pin = SPI_AI_SCK_PIN;
    GPIO_Init(SPI_AI_SCK_GPIO_PORT, GPIO_InitStructure);

