JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
    /* SPI  MOSI pin configuration */
    GPIO_InitStructure->GPIO_Pin = SPI_AI_MOSI_PIN;
    GPIO_Init(SPI_AI_MOSI_GPIO_PORT, GPIO_InitStructure);

    /* SPI MISO pin configuration */
    GPIO_InitStructure->GPIO_Pin = SPI_AI_MISO_PIN;
    GPIO_Init(SPI_AI_MISO_GPIO_PORT, GPIO_InitStructure);

    /* SPI NSS pin configuration */
    GPIO_LOWInitStructure->GPIO_Pin = SPI_AI_NSS_PIN;
    GPIO_Init(SPI_AI_NSS_GPIO_PORT, GPIO_LOWInitStructure);
#if 0 //TEST引脚
    GPIO_InitStructure->GPIO_Pin = GPIO_Pin_14;
    GPIO_InitStructure->GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure->GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure->GPIO_PuPd  = GPIO_PuPd_UP;
    GPIO_InitStructure->GPIO_Speed = GPIO_Speed_Level_3;
    GPIO_Init(GPIOB, GPIO_InitStructure);
    /*set*/
    GPIO_SetBits(GPIOB,GPIO_Pin_14);
#endif
    /*DRDY触发引脚配置*/
    GPIO_InitStructure->GPIO_Pin = TIM_AI_TRIGGER_PIN; 
    GPIO_InitStructure->GPIO_Mode = GPIO_Mode_IN;
    GPIO_InitStructure->GPIO_PuPd  = GPIO_PuPd_NOPULL;    
    GPIO_Init(TIM_AI_TRIGGER_GPIO_PORT, GPIO_InitStructure);

    /*配置SPI初始化参数*/
    SPI_InitStructure->SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure->SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure->SPI_CPOL = SPI_CPOL_Low;
    SPI_InitStructure->SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure->SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure->SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32;
    SPI_InitStructure->SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure->SPI_CRCPolynomial = SPI_AI_CRCPolynomial;
    SPI_InitStructure->SPI_Mode = SPI_Mode_Master;

    /*配置DMA接收初始化参数*/
    DMA_RXInitStructure->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_RXInitStructure->DMA_MemoryDataSize =  DMA_MemoryDataSize_Byte;
    DMA_RXInitStructure->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_RXInitStructure->DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_RXInitStructure->DMA_Mode = DMA_Mode_Normal;
    DMA_RXInitStructure->DMA_M2M = DMA_M2M_Disable;
    DMA_RXInitStructure->DMA_BufferSize = SPI_AI_DMA_RECEIVESIZE;
    DMA_RXInitStructure->DMA_PeripheralBaseAddr = (uint32_t)SPI_AI_DR_ADDRESS;
    DMA_RXInitStructure->DMA_MemoryBaseAddr = (uint32_t)SPI_AI_RxBuffer;
    DMA_RXInitStructure->DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_RXInitStructure->DMA_Priority = DMA_Priority_High;

    /*配置DMA发送初始化参数*/
    DMA_TXInitStructure->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_TXInitStructure->DMA_MemoryDataSize =  DMA_MemoryDataSize_Byte;
    DMA_TXInitStructure->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_TXInitStructure->DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_TXInitStructure->DMA_Mode = DMA_Mode_Normal;
    DMA_TXInitStructure->DMA_M2M = DMA_M2M_Disable;
    DMA_TXInitStructure->DMA_BufferSize = SPI_AI_DMA_SENDSIZE;
    DMA_TXInitStructure->DMA_PeripheralBaseAddr = (uint32_t)SPI_AI_DR_ADDRESS;
    DMA_TXInitStructure->DMA_MemoryBaseAddr = (uint32_t)SPI_AI_TxBuffer;
    DMA_TXInitStructure->DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_TXInitStructure->DMA_Priority = DMA_Priority_Low;
    return E_STM32F0_AI_SPI_OK;
}


void ADS1248_Delay(uint32_t nCount)
{
    uint32_t i, j;

    for(i = 0; i < 4; i++)
    {
        for(j = 0; j < nCount; j++);
    }
}


/******************************************************************
*函数名称:STM32F0Ads1248DriverInit
*功能描述:初始化SPI DMA GPIO等结构体
*输入参数:
*输出参数:STM32F0_SPI_AI_DRIVER_ERROR_e
*返回值:函数执行结果
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/23                              
******************************************************************/
STM32F0_SPI_AI_DRIVER_ERROR_e STM32F0Ads1248DriverInit(TableType_e tTypeIn,SPI_InitTypeDef  *SPI_InitStructure, GPIO_InitTypeDef  *GPIO_InitStructure, 
                                                      GPIO_InitTypeDef  *GPIO_LOWInitStructure, DMA_InitTypeDef  *DMA_RXInitStructure, DMA_InitTypeDef  *DMA_TXInitStructure)
{
     /*判断SPI初始化指针是否为空*/
    if (NULL == SPI_InitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
    /*判断GPIO初始化指针是否为空*/
    if (NULL == GPIO_InitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
    /*判断MOSI初始化指针是否为空*/
    if (NULL == GPIO_LOWInitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
    /*判断DMA接收结构体指针是否为空*/
    if (NULL == DMA_RXInitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }
    /*判断DMA发送结构体指针是否为空*/
    if (NULL == DMA_TXInitStructure)
    {
        return E_STM32F0_AI_SPI_CONFIGURATION_PARA_ERROR;
    }

    /*Deinitializes the SPIx peripheral registers to their default reset values*/
    SPI_I2S_DeInit(SPI_AI);

    /*拉高片选*/ 
    GPIO_SetBits(SPI_AI_NSS_GPIO_PORT,SPI_AI_NSS_PIN);

    /* Initializes the SPI communication */
    SPI_Init(SPI_AI, SPI_InitStructure);
    /*使能nss脉冲*/
    SPI_NSSPulseModeCmd(SPI_AI, ENABLE);

    /* Initialize the FIFO threshold */
    SPI_RxFIFOThresholdConfig(SPI_AI, SPI_RxFIFOThreshold_QF);
    /*DMA初始化*/
    DMA_Init(SPI_AI_RX_DMA_CHANNEL, DMA_RXInitStructure);
    DMA_Init(SPI_AI_TX_DMA_CHANNEL, DMA_TXInitStructure);

    /*使能DMA请求*/
    SPI_I2S_DMACmd(SPI_AI, SPI_I2S_DMAReq_Rx, ENABLE);
    SPI_I2S_DMACmd(SPI_AI,SPI_I2S_DMAReq_Tx,ENABLE);
    
    /*使能SPI*/
    SPI_Cmd(SPI_AI, ENABLE);

    /*拉低START*/    
    GPIO_ResetBits(ADS_START_GPIO_PORT,ADS_START_CONTROL_PIN);

    /*芯片上电到MAIN函数第一步，需要8ms   第一条语句到执行SPI发送第一个数据
          延时8.399825ms     启动到开始配置ADS时间大概  8ms + 8.399825ms*/
    ADS1248_Delay(13000);

    
    /*禁能DMA通道*/
    DMA_Cmd(SPI_AI_TX_DMA_CHANNEL,DISABLE);    
    DMA_Cmd(SPI_AI_RX_DMA_CHANNEL,DISABLE);
    
    SPI_AI_TxBuffer[0] =ADS_RESET;
    
    DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,1);   
    DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,1);

    /*使能DMA通道*/
    SendDMACmd();
    /*复位之后需要等待0.6ms*/
    ADS1248_Delay(2000);
    
    ADS1248_StartConvert();
    
    /*发送共用的参数*/
#if (IO_CODE_TYPE == FR3924_CODE)   
    /*根据传感器类型初始化通道校准值*/
    (void)SetCalibrationValueByThermocoupleType(tTypeIn);
    /*根据传感器类型初始化配置参数*/
    ConfigureDataByThermocoupleType(tTypeIn);
#endif

#if (IO_CODE_TYPE == FR3822_CODE)
    ConfigureDataByThermalResistanceType(tTypeIn);
#endif
    /*置状态为RUNING*/ 
    gtaAISampleInfo[TMEPERATURE_CHANNEL_0].eChannelStatus =  E_CHANNEL_RUNNING;
    for(uint8_t i=0;i<MAX_AI_CHANNEL_NUMBER;i++)
    {
        gtaAISampleInfo[i].ucConnectionFlag = ADS_DISCONNECTION;
    }
    return E_STM32F0_AI_SPI_OK;
}


/******************************************************************
*函数名称:void SendDMACmd(void)
*功能描述:使能DMA发送函数
*输入参数:void
*输出参数: void
*返回值: 无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/31                              
******************************************************************/
void SendDMACmd(void)
{
    uint8_t i = 0;

    /*关闭串口中断*/    
    asm ("CPSID   I");

    /*拉低片选*/
    SPI_AI_NSS_GPIO_PORT->BRR = SPI_AI_NSS_PIN;

    /*启动DMA_RX接收*/
    SPI_AI_RX_DMA_CHANNEL->CCR |= DMA_CCR_EN;
    /*启动DMA_TX发送*/
    SPI_AI_TX_DMA_CHANNEL->CCR |= DMA_CCR_EN;

    while(SET != DMA_GetFlagStatus(DMA1_FLAG_TC2))
    {
        /*清除主站与其它从站交互导致的串口中断标志位*/
         if ( (SET == USART_GetITStatus(USART1, USART_IT_RTO)))
         {
             /*未接收到字节则直接退出*/
             if (DMA_RECEIVE_BUFSIZE == DMA1_Channel5->CNDTR)
             {
                 /*  清除超时中断标志*/
                 USART1->ICR = USART_FLAG_RTO;
             }
         }
    }
    DMA_ClearFlag(DMA1_FLAG_TC2);

 
    /* 延时1.7微秒以上*/
    for (i=0; i< 15; i++);
    
    /*拉高片选*/
    SPI_AI_NSS_GPIO_PORT->BSRR = SPI_AI_NSS_PIN;

