JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
    /*打通串口中断*/    
    asm ("CPSIE   I");

}


/******************************************************************
*函数名称:void UpdateDataArea(int64_t* piTableValueIn)
*功能描述:更新用户业务数据区  并以四舍五入的方式进行精度保留
*输入参数:piTableValueIn  温度数据地址
*输出参数:无
*返回值: void
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/19                              
******************************************************************/
void UpdateDataArea(int64_t* piTableValueIn)
{
    int32_t iTemperature = *piTableValueIn; //温度被放大100000
    int8_t cDataTemp = 0;
    /*对数据进行四舍五入保留两位小数*/
    iTemperature = iTemperature/PRECISION_MAGNIFICATION_1000;
    /*取出最后一位小数并判断是否大于4*/
    cDataTemp = iTemperature%PRECISION_MAGNIFICATION_10;
    if(cDataTemp > 4)
    {
        /*对数据进行进一位处理*/
        iTemperature = iTemperature + PRECISION_MAGNIFICATION_10;
    }
    if(cDataTemp <= -5)
    {        
        /*对数据进行进一位处理*/
        iTemperature = iTemperature - PRECISION_MAGNIFICATION_10;
    }
    /*最后用户使用的数据为保留一位小数*/
    iTemperature = iTemperature/PRECISION_MAGNIFICATION_10;
    
    /*更新数据区*/
#if (IO_CODE_TYPE == FR3924_CODE)   
    gusaAnalogData[gucCurrentIndex/2] = (int16_t)(iTemperature);
#endif
#if (IO_CODE_TYPE == FR3822_CODE)
    gusaAnalogData[gucCurrentIndex/2] = (int16_t)(iTemperature);
#endif
    return;
}

/******************************************************************
*函数名称:void TableLinearFitting(TableLinear_t* ptLinearLinearIn, int64_t iLinearValueIn, int64_t* piTableValueOut)
*功能描述: 线性拟合计算
*输入参数:TableLinear_t 拟合区间 iLinearValueIn 拟合的值 piTableValueOut拟合结果地址
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/13                              
******************************************************************/
void TableLinearFitting(TableLinear_t* ptLinearLinearIn, int64_t iLinearValueIn, int64_t* piTableValueOut)
{
    int64_t lLineartemp = iLinearValueIn;//;PRECISION_MAGNIFICATION
    int64_t sTemp = 0;
    /*保存精度  放大100000*/
    sTemp = (lLineartemp - ptLinearLinearIn->usaLinearValue1)*PRECISION_MAGNIFICATION/(int32_t)((ptLinearLinearIn->usaLinearValue2 - ptLinearLinearIn->usaLinearValue1));

    *piTableValueOut = (ptLinearLinearIn->lTemperature_1)*PRECISION_MAGNIFICATION + sTemp*(ptLinearLinearIn->lTemperature_2 - ptLinearLinearIn->lTemperature_1);
    return;
}

/******************************************************************
*函数名称:void ADS1248_StartConvert(void)
*功能描述:拉高START
*输入参数:void
*输出参数:无
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/11                              
******************************************************************/
void ADS1248_StartConvert(void)
{
    /*START引脚拉高*/
    GPIO_SetBits(ADS_START_GPIO_PORT,ADS_START_CONTROL_PIN);
    return;
}

/******************************************************************
*函数名称:void ADS1248_StopConvert(void)
*功能描述:拉低START引脚
*输入参数:void
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/31                              
******************************************************************/
void ADS1248_StopConvert(void)
{
    /*START引脚拉低*/
    GPIO_ResetBits(ADS_START_GPIO_PORT,ADS_START_CONTROL_PIN);
    return;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e ADS1248_lOOP(TableType_e ucTypeIn)
*功能描述:ADS1248循环工作主函数 
*输入参数:ucTypeIn   表格类型
*输出参数:IO_InterfaceResult_e 
*返回值:      E_IO_ERROR_NONE  无错误 
                         E_IO_ERROR_TABLE_OVERFLOW  数据溢出 
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/11                              
******************************************************************/
IO_InterfaceResult_e ADS1248_lOOP(TableType_e ucTypeIn)
{
    STM32F0_SPI_AI_DRIVER_ERROR_e eAiSpiDrvierReturnCode = E_STM32_AI_SPI_BUTT;
    SPI_InitTypeDef     SPI_InitStructure;
    GPIO_InitTypeDef    GPIO_InitStructure;
    GPIO_InitTypeDef    GPIO_LOWInitStructure;
    NVIC_InitTypeDef    NVIC_InitStructure;
    DMA_InitTypeDef     DMA_RXInitStructure;
    DMA_InitTypeDef     DMA_TXInitStructure;
#if (IO_CODE_TYPE == FR3924_CODE)   
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    int64_t iTemperature = 0;
    int32_t iVoltageTemp = 0; 
    uint64_t ullDataTemp = 0;
    TableLinear_t tTableLinear;
    int64_t liSampleSum = 0;
#endif    
    int32_t iFilterData = 0;

    if (eInitCompleteFlag == E_INIT_NONE)
    {
        return E_IO_ERROR_NONE;
    }

    if (eInitCompleteFlag == E_INIT_MCU_COMPLETE)
    {

        /* AI SPI驱动使用的结构体初始化 */
        memset ( &SPI_InitStructure, 0, sizeof ( SPI_InitTypeDef ) );
        memset ( &GPIO_InitStructure, 0, sizeof ( GPIO_InitTypeDef ) );
        memset ( &GPIO_LOWInitStructure, 0, sizeof ( GPIO_InitTypeDef ) );
        memset ( &NVIC_InitStructure, 0, sizeof ( NVIC_InitTypeDef ) );
        memset ( &DMA_RXInitStructure, 0, sizeof ( DMA_InitTypeDef ) );
        memset ( &DMA_TXInitStructure, 0, sizeof ( DMA_InitTypeDef ) );

        /*  SPI驱动初始化 */
        eAiSpiDrvierReturnCode = STM32F0Ads1248DriverConfig(ucTypeIn,&SPI_InitStructure, &GPIO_InitStructure, 
                 &GPIO_LOWInitStructure, &DMA_RXInitStructure, &DMA_TXInitStructure);
        if (E_STM32F0_AI_SPI_OK != eAiSpiDrvierReturnCode)
        {
            return E_IO_ERROR_ADS_SPI_DRIVER_CONFIG;
        }

        eAiSpiDrvierReturnCode = STM32F0Ads1248DriverInit(ucTypeIn,&SPI_InitStructure, &GPIO_InitStructure, 
                 &GPIO_LOWInitStructure,  &DMA_RXInitStructure, &DMA_TXInitStructure);
        if (E_STM32F0_AI_SPI_OK != eAiSpiDrvierReturnCode)
        {
            return E_IO_ERROR_ADS_SPI_DRIVER_INIT;
        }
   
        eInitCompleteFlag = E_INIT_DRIVER_COMPLETE;
    }


    /*判断是否需要启动当前通道*/
    if(E_CHANNEL_INITIALIZATION ==gtaAISampleInfo[gucCurrentIndex].eChannelStatus)
    {    
       /*启动ADS转换*/
        ADS1248_StartConvert();
#if (IO_CODE_TYPE == FR3924_CODE)   
        /*配置当前通道信息*/
        ConfigureDataToADS(gucCurrentIndex,ucTypeIn);
#endif
#if (IO_CODE_TYPE == FR3822_CODE)   
        /*配置当前通道信息*/
        ConfigureDataToADS(gucCurrentIndex);
#endif

        /*置当前通道为RUNING状态*/
        gtaAISampleInfo[gucCurrentIndex].eChannelStatus =  E_CHANNEL_RUNNING;
        
