JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
     }
    /*判断当前通道是不是RUNNING状态*/
    if(E_CHANNEL_RUNNING ==gtaAISampleInfo[gucCurrentIndex].eChannelStatus)
    {
        /*检测DRDY为低*/
        if(Bit_RESET == (DATARADYPORT->IDR & DRDAYPIN))
        {
            /*获取ADS数据*/
            giaSPIAIFilterHandleBuffer[sucSampleTimes] = 0;
            giaSPIAIFilterHandleBuffer[sucSampleTimes] = ((uint32_t)(SPI_AI_RxBuffer[1]) << 16) | ((uint32_t)(SPI_AI_RxBuffer[2]) << 8) | SPI_AI_RxBuffer[3];
            if (giaSPIAIFilterHandleBuffer[sucSampleTimes] & 0x00800000)
            {
                giaSPIAIFilterHandleBuffer[sucSampleTimes] = giaSPIAIFilterHandleBuffer[sucSampleTimes] | 0xFF000000;
            }
            
            /*禁能DMA*/            
            DMA_Cmd(SPI_AI_TX_DMA_CHANNEL,DISABLE); 
            DMA_Cmd(SPI_AI_RX_DMA_CHANNEL,DISABLE); 
            
            DMA_ClearFlag(DMA1_FLAG_GL2);
            DMA_ClearFlag(DMA1_FLAG_GL3);
            /*发送DMA_TXBUFFER*/
            /*组装发送数据*/
            *(uint32_t *)(SPI_AI_TxBuffer) = RDATACMD;
            /*设置DMA发送的长度*/
            DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RDATACMDLENGTH);
            DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RDATACMDLENGTH);
    
            /*使能DMA通道*/
            SendDMACmd();

            /*读数据次数增1*/
            sucSampleTimes++;
        }
#if (IO_CODE_TYPE == FR3822_CODE) 
        /*为了减少对数据更新周期影响，断连检测只采集两组数据*/
        if ( TMEPERATURE_CHANNEL_4 == gucCurrentIndex || TMEPERATURE_CHANNEL_5 ==gucCurrentIndex)
        {
            if (RTD_USER_CHANNEL_SAMPLE_TIMES == sucSampleTimes)
            {
                /*停止ADS转换*/
                ADS1248_StopConvert();
                /*次数清零*/
                sucSampleTimes = 0;
                /*置当前通道为CALC状态*/
                gtaAISampleInfo[gucCurrentIndex].eChannelStatus = E_CHANNEL_CALCATING;
            }
        }

        /*判断当前采样次数*/
        if(READDATATIMES == sucSampleTimes)
        {
            /*停止ADS转换*/
            ADS1248_StopConvert();
            /*次数清零*/
            sucSampleTimes = 0;
                                             
            /*置当前通道为CALC状态*/
            gtaAISampleInfo[gucCurrentIndex].eChannelStatus = E_CHANNEL_CALCATING;
        }
 #endif    

#if (IO_CODE_TYPE == FR3924_CODE) 

        /*对通道采样值进行如下计算*/
        if ( TMEPERATURE_CHANNEL_0 ==gucCurrentIndex || TMEPERATURE_CHANNEL_1 ==gucCurrentIndex
             || TMEPERATURE_CHANNEL_2 ==gucCurrentIndex || TMEPERATURE_CHANNEL_3 ==gucCurrentIndex )
        {
            /*判断当前采样次数*/
            if(READDATATIMES == sucSampleTimes)
            {
                /*停止ADS转换*/
                ADS1248_StopConvert();
                /*次数清零*/
                sucSampleTimes = 0;
                                                 
                /*置当前通道为CALC状态*/
                gtaAISampleInfo[gucCurrentIndex].eChannelStatus = E_CHANNEL_CALCATING;  
            }
        }
        /*冷端补偿只采样一次数据*/
        else
        {
            /*判断当前采样次数*/
            if(READDATATIMES_COMPENSATION == sucSampleTimes)
            {
                /*停止ADS转换*/
                ADS1248_StopConvert();
                /*次数清零*/
                sucSampleTimes = 0;
                                                 
                /*置当前通道为CALC状态*/
                gtaAISampleInfo[gucCurrentIndex].eChannelStatus = E_CHANNEL_CALCATING;      
            }
        }

  #endif      
    }
    /*判断当前通道是否可以处理*/
    if(E_CHANNEL_CALCATING ==gtaAISampleInfo[gucCurrentIndex].eChannelStatus)
    {    
#if (IO_CODE_TYPE == FR3822_CODE) 

        /*滤波并将滤波数据保存返回*/
        if ( TMEPERATURE_CHANNEL_4 == gucCurrentIndex || TMEPERATURE_CHANNEL_5 ==gucCurrentIndex)
        {
            /*采集两次，第一次为垃圾数据，保存第二次数据用于断连检测*/
            gtaAISampleInfo[gucCurrentIndex].ulChannelDisconnectValue = giaSPIAIFilterHandleBuffer[ADS_DISCONNECTION_VALIED_VALUE];
        }
        else
        {
            ArithmeticAverageFilterCalc(giaSPIAIFilterHandleBuffer,&iFilterData);
        }
#endif      
#if (IO_CODE_TYPE == FR3924_CODE) 
        /*判断是否需要冷端补偿*/
        if ( COMPENSATION_CHANNEL_0 ==gucCurrentIndex || COMPENSATION_CHANNEL_1 ==gucCurrentIndex
             || COMPENSATION_CHANNEL_2 ==gucCurrentIndex || COMPENSATION_CHANNEL_3 ==gucCurrentIndex )
        {
            /*采集两次，第一次为垃圾数据，保存第二次数据用于冷端补偿*/
            for (uint8_t i = 0; i < READDATATIMES_COMPENSATION - 1; i++)
            {
                liSampleSum += giaSPIAIFilterHandleBuffer[i+1];

            }
            /*5个数据 1个垃圾数据不丢弃*/
            iFilterData = liSampleSum/(READDATATIMES_COMPENSATION-1);
        }
        else
        {
            ArithmeticAverageFilterCalc(giaSPIAIFilterHandleBuffer,&iFilterData);
        }
#endif 

#if (IO_CODE_TYPE == FR3822_CODE) 
        if ( TMEPERATURE_CHANNEL_4 != gucCurrentIndex || TMEPERATURE_CHANNEL_5 !=gucCurrentIndex)
        {
            /*保存数据*/
            GetDataToDivingSource(&gaDivingSourceInfo,iFilterData);
        }
        /*在温度计算前进行断连判断*/
        
        /*温度计算 调试第一种类型表格*/
        (void)TempConversion(ucTypeIn,&gaDivingSourceInfo);
#endif

#if (IO_CODE_TYPE == FR3924_CODE) 
        /*温度计算 调试第一种类型表格*/
        (void)TempConversion(ucTypeIn,&iFilterData);
#endif        

        /*置当前通道为INIT*/
        gtaAISampleInfo[gucCurrentIndex].eChannelStatus = E_CHANNEL_INITIALIZATION;

#if (IO_CODE_TYPE == FR3822_CODE) 
        /*当前通道进行偏移 偏移的顺序0->1->2->3->0->1.....*/
        gucCurrentIndex = (gucCurrentIndex+1)%6;
        if (0 == gucCurrentIndex)
        {
            eInitCompleteFlag = E_LED_SET_COMPLETE;

            if ((ADSDISCONNECTIONVALUE ==gtaAISampleInfo[TMEPERATURE_CHANNEL_4].ulChannelDisconnectValue) 
                  || (ADSDISCONNECTIONVALUE_tvs == gtaAISampleInfo[TMEPERATURE_CHANNEL_4].ulChannelDisconnectValue))
            {
                gtaAISampleInfo[0].ucConnectionFlag = ADS_DISCONNECTION;
            }

            if ((ADSDISCONNECTIONVALUE ==gtaAISampleInfo[TMEPERATURE_CHANNEL_5].ulChannelDisconnectValue) 
                  || (ADSDISCONNECTIONVALUE_tvs == gtaAISampleInfo[TMEPERATURE_CHANNEL_5].ulChannelDisconnectValue))
            {
                gtaAISampleInfo[1].ucConnectionFlag = ADS_DISCONNECTION;
            }
        }
#endif
        /*FR3924有冷端补偿 冷端补偿由ADS处理*/
#if (IO_CODE_TYPE == FR3924_CODE) 
        /*判断是否需要冷端补偿*/
        if ( COMPENSATION_CHANNEL_0 ==gucCurrentIndex || COMPENSATION_CHANNEL_1 ==gucCurrentIndex
             || COMPENSATION_CHANNEL_2 ==gucCurrentIndex || COMPENSATION_CHANNEL_3 ==gucCurrentIndex )      
        {         
            memset(&tTableLinear,0,sizeof(tTableLinear));

            /*码值转换成电压值*/
            ullDataTemp = (uint64_t)iFilterData;
            ullDataTemp = ullDataTemp*COLDENDVOLTAGE >>RESOLUTIONBITLENGTH_23;
            iVoltageTemp = (int32_t)ullDataTemp;
            /*热敏电阻对应的温度*/
            eResult = MCU_TEM_Compensation(iVoltageTemp,&iTemperature);
            if(E_IO_ERROR_NONE != eResult)
            {
                /*当前通道进行偏移 偏移到下一个*/
                gucCurrentIndex = (gucCurrentIndex+1)%8;
                return eResult;
            }
            /*通过温度查分度表 得到对应的电压*/
            eResult = GetTemperatureFromTable(ucTypeIn,iTemperature,&tTableLinear);
            if(E_IO_ERROR_NONE != eResult)
            {
                /*当前通道进行偏移 偏移到下一个*/
                gucCurrentIndex = (gucCurrentIndex+1)%8;
                /*数据超限  不需要进行线性拟合*/
                return eResult;
            }
            /*线性拟合  查表反向  知道温度，拟合出分度表对应的电压*/
            TableLinearFittingReverse(&tTableLinear,iTemperature,&gtaAISampleInfo[gucCurrentIndex].lCompensationValue); 
            /*增加对冷端补偿的标定*/
            gtaAISampleInfo[gucCurrentIndex].lCompensationValue -= gtaAISampleInfo[gucCurrentIndex].lCalibrationValue;
            
