JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
        }
        
        /*当前通道进行偏移 偏移到下一个*/
        gucCurrentIndex = (gucCurrentIndex+1)%8;
        if (0 == gucCurrentIndex)
        {
            eInitCompleteFlag = E_LED_SET_COMPLETE;

            
        }
#endif    
    }
    return E_IO_ERROR_NONE;
}
#if (IO_CODE_TYPE == FR3924_CODE)

/******************************************************************
*函数名称:void TemperatureOffsetCalc(TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut)
*功能描述:通过表的类型 对温度进行偏移计算
*输入参数:ucTypeIn  表格类型   ptLinearLinearInOut线性区间的地址 
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/17                              
******************************************************************/
/*改变入参  只传入INDEX  */
void TemperatureOffsetCalc(TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut)
{
    /*对温度进行偏移*/  
        /*FR3924FLASH中存放的数据是以2摄氏度为间隔存放，与FR3822存入格式不相同*/
    ptLinearLinearInOut->lTemperature_1 = (ptLinearLinearInOut->lTemperature_1)*TEMPERATURE_INTERVAL_2 +gtaTableInfo[ucTypeIn].sStartTemperature;
    ptLinearLinearInOut->lTemperature_2 = (ptLinearLinearInOut->lTemperature_2)*TEMPERATURE_INTERVAL_2 +gtaTableInfo[ucTypeIn].sStartTemperature;
    return;
}

/******************************************************************
*函数名称:void TemperatureOffsetCalc(TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut)
*功能描述:通过表的类型 对温度进行偏移计算
*输入参数:ucTypeIn  表格类型   ptLinearLinearInOut线性区间的地址 
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/17                              
******************************************************************/
/*改变入参  只传入INDEX  */
void TemperatureOffsetCalcForThermistor (TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut)
{
    /*对温度进行偏移*/  
        /*FR3924FLASH中存放的数据是以2摄氏度为间隔存放，与FR3822存入格式不相同*/
    ptLinearLinearInOut->lTemperature_1 = ptLinearLinearInOut->lTemperature_1 +gtaTableInfo[ucTypeIn].sStartTemperature;
    ptLinearLinearInOut->lTemperature_2 = ptLinearLinearInOut->lTemperature_2 +gtaTableInfo[ucTypeIn].sStartTemperature;
    return;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e GetValueFromTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
*功能描述:二分法查表
*输入参数:ucTypeIn 热电偶类型  iCheckValueIn 查表值 ptLinearLinearOut 线性区间地址
*输出参数:IO_InterfaceResult_e
*返回值:      E_IO_ERROR_TABLE_DATA  数据溢出
                         E_IO_ERROR_NONE          无错误 
*其它说明:
*修改日期    版本号   修改人    修改内容
                                                                  不将表格内容当成数据传入进来，直接从FLASH中读取 需要确定读取哪l表
*---------------------------------------------------
*2018/3/13                              
******************************************************************/
IO_InterfaceResult_e GetValueFromTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    uint16_t usLowIndex = 0;
    /*保存二分法循环变量*/
    uint16_t  usMiddleIndex = 0;
    uint16_t usHighIndex = 0;
    /*定义变量保存从FLASH中读取的数据*/
    uint32_t ulMaxValue = 0;
    uint32_t ulMinVALue = 0;
    uint16_t usCalcTemp1 = 0;
    uint16_t usCalcTemp2 = 0;
    /*比较变量*/
    uint64_t usCompareValue = 0;
    /*定义变量保存地址*/
    uint32_t uiAddressTemp = 0;

    /*缩小100000倍  需要缩小*/
    iCheckValueIn = iCheckValueIn/PRECISION_MAGNIFICATION;
    usCompareValue = iCheckValueIn;
    usHighIndex = guiTableLength/2 -1;
    memcpy(&ulMinVALue,(void *)(guiTableAddress),2);
    memcpy(&ulMaxValue,(void *)(guiTableAddress + (usHighIndex)*2),2);
    uiAddressTemp = guiTableAddress;
    
    if((usCompareValue < ulMinVALue) || (usCompareValue > ulMaxValue))
    {
        eResult = E_IO_ERROR_TABLE_DATA;
        return eResult; // 超限，不做特殊处理
    }

    while(usHighIndex >= usLowIndex)
    {
        usMiddleIndex = (usHighIndex + usLowIndex) / 2;
        
        /*mid的值有变化，重新读取对应FLASH中的地址*/
        memcpy(&usCalcTemp1,(void *)(uiAddressTemp + (usMiddleIndex)*2),2);

        if((usCompareValue >= usCalcTemp1) || (0 == usMiddleIndex))
        {
            /*计算Middle+1的值*/            
            memcpy(&usCalcTemp2,(void *)(uiAddressTemp + (usMiddleIndex+1)*2 ),2);
            if(usCompareValue <= usCalcTemp2)
            {
                ptLinearLinearOut->lTemperature_1 = usMiddleIndex;
                ptLinearLinearOut->lTemperature_2 = usMiddleIndex+1;
                ptLinearLinearOut->usaLinearValue1 = usCalcTemp1;
                ptLinearLinearOut->usaLinearValue2 = usCalcTemp2;
                /*对温度进行偏移*/
                TemperatureOffsetCalc(ucTypeIn,ptLinearLinearOut);
                return E_IO_ERROR_NONE;
            }
            else
            {
                usLowIndex = usMiddleIndex + 1;
            }
        }
        else if(usCompareValue < usCalcTemp1)
        {
            usHighIndex = usMiddleIndex - 1;
        }
    }
    return E_IO_ERROR_NONE;
}

/******************************************************************
*函数名称:void TableLinearFittingReverse(TableLinear_t* ptLinearLinearIn, uint64_t ulLinearValueIn, uint32_t* puiTableValueOut)
*功能描述: 线性拟合计算 
*输入参数:TableLinear_t 线性拟合区间 ulLinearValueIn 拟合的值 puiTableValueOut 拟合结果值地址
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/13                              
******************************************************************/
void TableLinearFittingReverse(TableLinear_t* ptLinearLinearIn, uint64_t ulLinearValueIn, int32_t* piTableValueOut)
{
    /*温度*/
    int64_t iTemperatureTemp = ulLinearValueIn;
    int64_t sTemp = 0;
    /*计算出拟合比例的值 被放大100000倍*/
    sTemp = (iTemperatureTemp - ptLinearLinearIn->lTemperature_1*PRECISION_MAGNIFICATION)/(ptLinearLinearIn->lTemperature_2 - ptLinearLinearIn->lTemperature_1);
    /*算出  放大100000倍*/
    *piTableValueOut = (ptLinearLinearIn->usaLinearValue1)*PRECISION_MAGNIFICATION + sTemp* (ptLinearLinearIn->usaLinearValue2 - ptLinearLinearIn->usaLinearValue1);

    return;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e ReadTableAddress(TableType_e eSnesorTypeIn)
*功能描述: 读取固化在FLASH中的地址及表格长度
*输入参数:eSnesorTypeIn  表格类型
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/17                              
******************************************************************/
IO_InterfaceResult_e ReadTableAddress(TableType_e eSnesorTypeIn)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NONE;
    /*读取热敏电阻起始地址*/    
    memcpy(&guiThermistorTableAddress,(void*)TABLEHEADADDRESS,FLASHADDRESSLEN);
    /*读取热敏电阻长度*/    
    memcpy(&guiThermistorTablelength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN),FLASHADDRESSLEN);
    switch(eSnesorTypeIn)
    {
    case E_THERMOCOUPLE_TYPE_K :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*2),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*3),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_J :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*4),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*5),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_T :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*6),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*7),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_E :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*8),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*9),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_N :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*10),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*11),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_S :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*12),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*13),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_R :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*14),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*15),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_B :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*16),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*17),FLASHADDRESSLEN);
        break;
    }
    case E_THERMOCOUPLE_TYPE_C :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*18),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*19),FLASHADDRESSLEN);
        break;
    }    

    default :
    {
        eResult = E_IO_ERROR_TABLE_TYPE;
        break;
    }
    }

