JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
    /*读取标定的温度值*/

    memcpy(&gtaAISampleInfo[COMPENSATION_CHANNEL_0].lCalibrationValue,(void*)CALIBRATIONADADDRESS, FLASHADDRESSLEN );    
    memcpy(&gtaAISampleInfo[COMPENSATION_CHANNEL_1].lCalibrationValue,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN), FLASHADDRESSLEN );    
    memcpy(&gtaAISampleInfo[COMPENSATION_CHANNEL_2].lCalibrationValue,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*2), FLASHADDRESSLEN );    
    memcpy(&gtaAISampleInfo[COMPENSATION_CHANNEL_3].lCalibrationValue,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*3), FLASHADDRESSLEN );    

    /*读取标定值，上面的标定是针对温度，此处标定针对通道采样码值*/
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_0].lCalibrationChannelValue_K,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*4), FLASHADDRESSLEN ); 
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_0].lCalibrationChannelValue_B,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*5), FLASHADDRESSLEN );  
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_1].lCalibrationChannelValue_K,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*6), FLASHADDRESSLEN ); 
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_1].lCalibrationChannelValue_B,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*7), FLASHADDRESSLEN ); 
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_2].lCalibrationChannelValue_K,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*8), FLASHADDRESSLEN ); 
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_2].lCalibrationChannelValue_B,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*9), FLASHADDRESSLEN );  
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_3].lCalibrationChannelValue_K,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*10), FLASHADDRESSLEN ); 
    memcpy(&gtaAISampleInfo[TMEPERATURE_CHANNEL_3].lCalibrationChannelValue_B,(void*)(CALIBRATIONADADDRESS+FLASHADDRESSLEN*11), FLASHADDRESSLEN ); 

    /*通道赋初值*/
    for(uint8_t i = 0; i < gucChannelCount; i++)
    {
        gusaAnalogData[i] = gtaTableInfo[eSnesorTypeIn].sEndTemperature*10;
    }
    return eResult;
}

/******************************************************************
*函数名称:void ConfigureDataToADS(uint8_t ucChannelIn)
*功能描述:利用DMA的外设将配置信息发送出去
*输入参数:当前通道(差分用户通道)
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/27                              
******************************************************************/
void ConfigureDataToADS(uint8_t ucChannelIn,TableType_e ucTypeIn)
{
    /*禁能DMA*/    
    DMA_Cmd(SPI_AI_TX_DMA_CHANNEL,DISABLE);    
    DMA_Cmd(SPI_AI_RX_DMA_CHANNEL,DISABLE);

    DMA_ClearFlag(DMA1_FLAG_GL2);    
    DMA_ClearFlag(DMA1_FLAG_GL3);

    /*根据通道组装TX BUFFER*/
    switch(ucChannelIn)
    {
    /*用户1通道*/
    case TMEPERATURE_CHANNEL_0 :
    { 
         /*配置GPIO开关*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_GPIODAT;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTU_USER_GPIO_SWITCH_1;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[4] =WRITEBYTENUM;
        SPI_AI_TxBuffer[5] =gtaTableInfo[ucTypeIn].uRegWriteValue;
        /*差分通道-sample*/
        SPI_AI_TxBuffer[6] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[7] = WRITEBYTENUM;
        SPI_AI_TxBuffer[8] = RTU_USER_CHANNEL_1; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_LEN);  

        /*使能DMA通道*/
        SendDMACmd();
        
        break;
    }
    /*补偿*/
    case COMPENSATION_CHANNEL_0 :
    {

        /*配置PGA1 RATE:160sps*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_SYS0;;
        SPI_AI_TxBuffer[1] =WRITEBYTENUM;
        SPI_AI_TxBuffer[2] =RTU_PGA_1_RATE_160; 
        /*差分通道-compensation */
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTU_COMPENSATION_CHANNEL_1; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);  

        /*使能DMA通道*/
        SendDMACmd();
        
        break;
    }
    /*采样*/
    case TMEPERATURE_CHANNEL_1 :
    {
        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[1] =WRITEBYTENUM;
        SPI_AI_TxBuffer[2] =gtaTableInfo[ucTypeIn].uRegWriteValue; 
         /*差分通道-sample*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTU_USER_CHANNEL_2; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_NO_GPIO_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_NO_GPIO_LEN);  

        /*使能DMA通道*/
        SendDMACmd();
        
        break;
    }
    /*补偿2*/
    case COMPENSATION_CHANNEL_1 :
    {  
        /*配置PGA1 RATE:160sps*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[1] =WRITEBYTENUM;
        SPI_AI_TxBuffer[2] =RTU_PGA_1_RATE_160; 
        /*差分通道-compensation */
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTU_COMPENSATION_CHANNEL_2; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);  

        /*使能DMA通道*/
        SendDMACmd();
        
        break;
    }
    /*用户3通道*/
    case TMEPERATURE_CHANNEL_2 :
    {
         /*配置GPIO开关*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_GPIODAT;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTU_USER_GPIO_SWITCH_2;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_SYS0;;
        SPI_AI_TxBuffer[4] =WRITEBYTENUM;
        SPI_AI_TxBuffer[5] =gtaTableInfo[ucTypeIn].uRegWriteValue; 
         /*差分通道*/
        SPI_AI_TxBuffer[6] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[7] = WRITEBYTENUM;
        SPI_AI_TxBuffer[8] = RTU_USER_CHANNEL_3; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_LEN);  

