JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
        /*使能DMA通道*/
        SendDMACmd();

        break; 
    }
    /*补偿3*/
    case COMPENSATION_CHANNEL_2 :
    {
        /*配置PGA1 RATE:160sps*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_SYS0;;
        SPI_AI_TxBuffer[1] =WRITEBYTENUM;
        SPI_AI_TxBuffer[2] =RTU_PGA_1_RATE_160; 
        /*差分通道-compensation */
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTU_COMPENSATION_CHANNEL_3; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);  

        /*使能DMA通道*/
        SendDMACmd();
        
        break;
    }
    /*采样*/
    case TMEPERATURE_CHANNEL_3 :
    {
        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_SYS0;;
        SPI_AI_TxBuffer[1] =WRITEBYTENUM;
        SPI_AI_TxBuffer[2] =gtaTableInfo[ucTypeIn].uRegWriteValue; 
        /*差分通道-sample*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTU_USER_CHANNEL_4; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_NO_GPIO_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_CHANNEL_CONFIG_NO_GPIO_LEN);  

        /*使能DMA通道*/
        SendDMACmd();
        
        break;
        
    }
    
    /*补偿4*/
    case COMPENSATION_CHANNEL_3 :
    {  
        /*配置PGA1 RATE:160sps*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_SYS0;;
        SPI_AI_TxBuffer[1] =WRITEBYTENUM;
        SPI_AI_TxBuffer[2] =RTU_PGA_1_RATE_160; 
        /*差分通道-compensation */
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTU_COMPENSATION_CHANNEL_4; 

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_COMPENSATION_CONFIG_LEN);  

        /*使能DMA通道*/
        SendDMACmd();
        
        break;
    }
    
    default :
    {
        break;
    }    
    }

    return;
}

/******************************************************************
*函数名称:void ConfigureDataByThermocoupleType(TableType_e tTypeIn)
*功能描述:根据热电偶类型组装全局DMA_TXBUFFER
*输入参数:tTypeIn  传感器类型
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/27                              
******************************************************************/
void ConfigureDataByThermocoupleType(TableType_e tTypeIn)
{
    /*禁能DMA*/    
    DMA_Cmd(SPI_AI_TX_DMA_CHANNEL,DISABLE);    
    DMA_Cmd(SPI_AI_RX_DMA_CHANNEL,DISABLE);
    switch(tTypeIn)
    {
    case E_THERMOCOUPLE_TYPE_T :
    {
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;    

         /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_128_RATE_160; 
        break;
    }
    case E_THERMOCOUPLE_TYPE_K :
    {
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

         /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_32_RATE_160; 
        break;
    }
    case E_THERMOCOUPLE_TYPE_S :
    {   
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_64_RATE_160; 

        break;
    }
    case E_THERMOCOUPLE_TYPE_E :
    {        
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_16_RATE_160; 

        break;
    }
    case E_THERMOCOUPLE_TYPE_J :
    { 
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
