JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_16_RATE_160; 

        break;
    }
    case E_THERMOCOUPLE_TYPE_N :
    { 
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_32_RATE_160; 

        break;
    }
    case E_THERMOCOUPLE_TYPE_R :
    { 
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_64_RATE_160; 

        break;
    }
    case E_THERMOCOUPLE_TYPE_B :
    { 
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;
        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        
        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_128_RATE_160; 

        break;
    }
    case E_THERMOCOUPLE_TYPE_C :
    {  
        /*FSC 0x400000h*/
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;

        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        

        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;

        /*配置PGA32 RATE:160sps*/
        SPI_AI_TxBuffer[9] = ADS_WREG | ADS_SYS0;
        SPI_AI_TxBuffer[10] =WRITEBYTENUM;
        SPI_AI_TxBuffer[11] =RTU_PGA_32_RATE_160; 

        break;
    }
    default :
    {
        break;
    }
    }


    /*N极偏置*/
    SPI_AI_TxBuffer[12] = ADS_WREG | ADS_VBIAS;
    SPI_AI_TxBuffer[13] = WRITEBYTENUM;
    SPI_AI_TxBuffer[14] = RTU_USER_VBIAS_VALUE;

    /*配置GPIO开关*/
    SPI_AI_TxBuffer[15] = ADS_WREG | ADS_GPIOCFG;
    SPI_AI_TxBuffer[16] = WRITEBYTENUM;
    SPI_AI_TxBuffer[17] = GPIO_MODE;

    /*GPIO  out mode*/
    SPI_AI_TxBuffer[18] = ADS_WREG | ADS_GPIODIR;
    SPI_AI_TxBuffer[19] = WRITEBYTENUM;
    SPI_AI_TxBuffer[20] = GPIO_OUT;

    SPI_AI_TxBuffer[21] = ADS_WREG | ADS_GPIODAT;
    SPI_AI_TxBuffer[22] = WRITEBYTENUM;
    SPI_AI_TxBuffer[23] = RTU_USER_GPIO_SWITCH_1;

    /*内置基准*/
    SPI_AI_TxBuffer[24] = ADS_WREG | ADS_MUX1;
    SPI_AI_TxBuffer[25] = WRITEBYTENUM;
    SPI_AI_TxBuffer[26] = REFSELT_VALUE;
    
    /*差分通道*/
    SPI_AI_TxBuffer[27] = ADS_WREG | ADS_MUX0;
    SPI_AI_TxBuffer[28] = WRITEBYTENUM;
    SPI_AI_TxBuffer[29] = RTU_USER_CHANNEL_1;
    /*设置DMA长度  配置信息长度30*/
    DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,RTU_USER_INIT_PARA_LEN);    
    DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,RTU_USER_INIT_PARA_LEN);

    /*使能DMA通道*/
    SendDMACmd();
    
    return;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e TempConversion(TableType_e ucTypeIn,int32_t *piFilterDataIn)
*功能描述:ADS采样温度计算
*输入参数:ucTypeIn 热电偶类型  piFilterDataIn滤波码值的地址
*输出参数:IO_InterfaceResult_e  函数执行结果
*返回值:IO_InterfaceResult_e
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/11                              
******************************************************************/
IO_InterfaceResult_e TempConversion(TableType_e ucTypeIn,int32_t *piFilterDataIn)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    int64_t iVoltageValue = 0;
    int64_t iTemperature = 0;
    int64_t iFilterData = *piFilterDataIn;
    TableLinear_t tTableLinear;        

    /*对通道采样值进行如下计算，补偿则不能以下面方式计算*/
    if ( TMEPERATURE_CHANNEL_0 ==gucCurrentIndex || TMEPERATURE_CHANNEL_1 ==gucCurrentIndex
         || TMEPERATURE_CHANNEL_2 ==gucCurrentIndex || TMEPERATURE_CHANNEL_3 ==gucCurrentIndex )
    {
        /*对采样码值判断*/
        if((ADSDISCONNECTIONVALUE_tvs == (int32_t)iFilterData )||((ADSDISCONNECTIONVALUE == (int32_t)iFilterData )))    
        {
            /*断连  置通道状态为断连状态*/
            gtaAISampleInfo[gucCurrentIndex].ucConnectionFlag = ADS_DISCONNECTION;
            /*更新数据区返回*/
            gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
            eResult = E_IO_ERROR_ADS_DATA_DISCONNECTION;
            return eResult;
        }
        /*通道状态置为连接状态*/
        gtaAISampleInfo[gucCurrentIndex].ucConnectionFlag = ADS_CONNECTION;
        memset(&tTableLinear,0,sizeof(TableLinear_t));

        /*此处对采样码值进行标定*/
        iFilterData = iFilterData*gtaAISampleInfo[gucCurrentIndex].lCalibrationChannelValue_K + gtaAISampleInfo[gucCurrentIndex].lCalibrationChannelValue_B;
        iFilterData = iFilterData/100000;

