JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
        /*码值转换成电压*/    
        iVoltageValue = ((iFilterData*RTU_SAMPLE_REFVOLTAGE)*PRECISION_MAGNIFICATION/gtaTableInfo[ucTypeIn].lPGA) >>RESOLUTIONBITLENGTH_23;
        
        /*根据热电偶类型对电压数据进行还原并放大100000倍*/
        ChangeVoltageRules(ucTypeIn,&iVoltageValue);
        /*补偿后的电压*/       
        iVoltageValue = iVoltageValue + gtaAISampleInfo[gucCurrentIndex+1].lCompensationValue;
#if 0

        /*表中数据*1000+10000的规则，但是对于 E型和J型是在原来的基础上再除以2*/
        /*Y1 = KX1+B  和Y2 = KX2+B同时相加，实际上多加了一个B，因此这里减去B值
            加入标定后，前面的计算已经将B值减去，此时不需要添加*/
        if ( E_THERMOCOUPLE_TYPE_E == ucTypeIn || E_THERMOCOUPLE_TYPE_J == ucTypeIn )
        {
            iVoltageValue = iVoltageValue + TABLE_GAIN_VALUE_5000*PRECISION_MAGNIFICATION;
        }
#endif    
        /*获取分度表   结构体命名*/
        eResult = GetValueFromTable(ucTypeIn,iVoltageValue,&tTableLinear);
        /*判断数据是否超限*/
        if(E_IO_ERROR_TABLE_DATA == eResult)
        {
            /*更新数据区返回*/
            gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
            /*通道状态超出量程*/
            gtaAISampleInfo[gucCurrentIndex].ucConnectionFlag = ADS_OVERFLOW;

            return eResult;
        }
        /*线性拟合*/
        iVoltageValue = iVoltageValue/PRECISION_MAGNIFICATION;
        TableLinearFitting(&tTableLinear,iVoltageValue,&iTemperature);
        /*更新数据区  查询出来的温度直接保留一位小数显示出来*/
        UpdateDataArea(&iTemperature); 
        
    }    
    return E_IO_ERROR_NONE;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e MCU_TEM_Compensation(int32_t iVoltageIn, int64_t * piTemperatureOut)
*功能描述:冷端温度补偿
*输入参数:iVoltageIn 补偿电压   
*输出参数:piTemperatureOut 温度地址
*返回值:IO_InterfaceResult_e
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/12                              
******************************************************************/
IO_InterfaceResult_e MCU_TEM_Compensation(int32_t iVoltageIn, int64_t * piTemperatureOut)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    int64_t iThermistorValue = 0;
    TableLinear_t tTableLinear;
    uint64_t ullVoltageTemp = 0;

    /*清0*/
    memset(&tTableLinear,0,sizeof(TableLinear_t));

    ullVoltageTemp = (uint64_t)iVoltageIn;
    
    /*单位转换成mV  阻值是 千欧 并放大 100000倍*/
    iThermistorValue = (VOLTAGE*(MCUREFERENCEVOLTAGE-ullVoltageTemp)/ullVoltageTemp);
    /*通过热敏电阻值 求出温度  */
    eResult = GetValueFromThermistorTable(E_THERMISTOR_TYPE,iThermistorValue,&tTableLinear);
    if(E_IO_ERROR_NONE != eResult)
    {
        return eResult;
    }
    /*已经取得温度数据 并且温度被放大100000倍*/
    TableLinearFitting(&tTableLinear,iThermistorValue,piTemperatureOut);

    return E_IO_ERROR_NONE;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e GetValueFromThermistorTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
*功能描述:查热敏电阻表
*输入参数:ucTypeIn 表格类型 iCheckValueIn  查表值 ptLinearLinearOut 线性拟合区间地址
*输出参数:IO_InterfaceResult_e
*返回值:      E_IO_ERROR_NONE     无错误 
                         E_IO_ERROR_TABLE_DATA  数据溢出    
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/19                              
******************************************************************/
IO_InterfaceResult_e GetValueFromThermistorTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NONE;
    uint16_t usLowIndex = 0;
    /*保存二分法循环变量*/
    uint16_t  usMiddleIndex = 0;
    uint16_t usHighIndex = 0;
    /*定义变量保存从FLASH中读取的数据*/
    uint32_t ulMaxValue = 0;
    uint32_t ulMinVALue = 0;
    uint32_t usCalcTemp1 = 0;
    uint32_t usCalcTemp2 = 0;
    /*定义变量保存地址*/
    uint32_t uiAddressTemp = 0;
    /*比较变量*/
    uint32_t usCompareValue = (uint32_t)(iCheckValueIn);
    /*转换成数据长度*/
    usHighIndex = guiThermistorTablelength/4 -1;
    /*热敏电阻的表是单调递减*/
    memcpy(&ulMaxValue,(void *)(guiThermistorTableAddress),4);
    memcpy(&ulMinVALue,(void *)(guiThermistorTableAddress + (usHighIndex)*4),4);

    if((usCompareValue < ulMinVALue) || (usCompareValue > ulMaxValue))
    {
        eResult = E_IO_ERROR_TABLE_DATA;
        return eResult; // 超限，不做特殊处理
    }
    uiAddressTemp = guiThermistorTableAddress;
    while(usHighIndex >= usLowIndex)
    {
        usMiddleIndex = (usHighIndex + usLowIndex) / 2;
        /*mid的值有变化，重新读取对应FLASH中的地址*/
        memcpy(&usCalcTemp1,(void *)(uiAddressTemp + (usMiddleIndex*4)),4);
        
        if((usCompareValue <= usCalcTemp1) || (0 == usMiddleIndex))
        {
            /*计算Middle+1的值*/            
            memcpy(&usCalcTemp2,(void *)(uiAddressTemp + (usMiddleIndex+1)*4 ),4);
            if(usCompareValue >= usCalcTemp2)
            {
                /*温度与实际索引相差1*/
                ptLinearLinearOut->lTemperature_1 = usMiddleIndex;
                ptLinearLinearOut->lTemperature_2 = usMiddleIndex+1;
                ptLinearLinearOut->usaLinearValue1 = usCalcTemp1;
                ptLinearLinearOut->usaLinearValue2 = usCalcTemp2;
                /*对温度进行偏移*/
                TemperatureOffsetCalcForThermistor(ucTypeIn,ptLinearLinearOut);
                return E_IO_ERROR_NONE;
            }
            else
            {
                usLowIndex = usMiddleIndex + 1;
            }
        }
        else if(usCompareValue > usCalcTemp1)
        {
            usHighIndex = usMiddleIndex - 1;
        }
    }    
    return E_IO_ERROR_NONE;

}

/******************************************************************
*函数名称:void ChangeVoltageRules(TableType_e ucTypeIn,int64_t* puiVoltageInOut)
*功能描述:表格类型(热电偶类型)      
*输入参数:puiVoltageInOut  转换值地址 
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/17                              
******************************************************************/
void ChangeVoltageRules(TableType_e ucTypeIn,int64_t* plVoltageInOut)
{
    /*定义变量保存入参的值*/
    int64_t lVoltageTemp = 0;
    
    lVoltageTemp = *plVoltageInOut;
    switch(ucTypeIn)
    {
    case E_THERMOCOUPLE_TYPE_T :
    {
        *plVoltageInOut = lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR;
        break;
    }
    case E_THERMOCOUPLE_TYPE_K :
    {
        *plVoltageInOut = lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR;
        break;
    }
    case E_THERMOCOUPLE_TYPE_S :
    {
        *plVoltageInOut = (lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR);
        break;
    }
    case E_THERMOCOUPLE_TYPE_E :
    {
        *plVoltageInOut = (lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR)>>1;
        break;
    }
    case E_THERMOCOUPLE_TYPE_J :
    {
        *plVoltageInOut = (lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR)>>1;
        break;
    }
    case E_THERMOCOUPLE_TYPE_N :
    {
        *plVoltageInOut = lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR;
        break;
    }
    case E_THERMOCOUPLE_TYPE_R :
    {
        *plVoltageInOut = lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR;
        break;
    }
    case E_THERMOCOUPLE_TYPE_B :
    {
        *plVoltageInOut = lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR;
        break;
    }
    case E_THERMOCOUPLE_TYPE_C :
    {
        *plVoltageInOut = lVoltageTemp*INDEXINGTABLEMULTIFACTOR+INDEXINGTABLEADDENDFACTOR;
        break;
    }    
    default :
    {
        break;
    }
    }
}

/******************************************************************
*函数名称:IO_InterfaceResult_e GetTemperatureFromTable(TableType_e ucTypeIn,int32_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
*功能描述:查分度表根据温度得到电压
*输入参数:ucTypeIn 表格类型  iCheckValueIn 查表值 
*输出参数:ptLinearLinearOut 线性拟合的区间 
*返回值:E_IO_ERROR_TABLE_OVERFLOW  数据溢出 
                   E_IO_ERROR_NONE         无错误 
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/16                              
******************************************************************/
IO_InterfaceResult_e GetTemperatureFromTable(TableType_e ucTypeIn,int32_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    int32_t iTemperatureTemp = 0;
    /*定义变量保存从FLASH中读取的数据*/
    uint16_t usMaxValue = 0;
    uint16_t usMinVALue = 0;
    uint16_t usIndexTemp1 = 0;
    uint16_t usIndexTemp2 = 0;
    /*温度值被放大了100000倍 这里缩小100000倍*/
    iTemperatureTemp = iCheckValueIn/PRECISION_MAGNIFICATION;

