JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
    if(iTemperatureTemp < gtaTableInfo[ucTypeIn].sStartTemperature || iTemperatureTemp >  gtaTableInfo[ucTypeIn].sEndTemperature )
    {
        eResult = E_IO_ERROR_TABLE_OVERFLOW;
        return eResult;
    }
    
    /*恢复成索引*/  
    /*FR3924的数据是以2摄氏度间隔存放，因此这里需要转换成INDEX,除以2*/
    usIndexTemp1 = (iTemperatureTemp -gtaTableInfo[ucTypeIn].sStartTemperature)/TEMPERATURE_INTERVAL_2;
    /*温度对应的上区间*/
    usIndexTemp2 = usIndexTemp1 + 1;
    memcpy(&usMinVALue,(void *)(guiTableAddress + (usIndexTemp1)*2),2);
    memcpy(&usMaxValue,(void *)(guiTableAddress + (usIndexTemp2)*2),2);
    /*保存温度*/
    ptLinearLinearOut->lTemperature_1 = (iTemperatureTemp/TEMPERATURE_INTERVAL_2)*TEMPERATURE_INTERVAL_2;
    /*下一个温度区间偏移2*/
    ptLinearLinearOut->lTemperature_2 = iTemperatureTemp+2;
    ptLinearLinearOut->usaLinearValue1 = usMinVALue;
    ptLinearLinearOut->usaLinearValue2 = usMaxValue;

    return E_IO_ERROR_NONE;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e GetTemperatureFromTable_Calibration(TableType_e ucTypeIn,int32_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
*功能描述:查分度表根据温度得到电压
*输入参数:ucTypeIn 表格类型  iCheckValueIn 查表值 
*输出参数:ptLinearLinearOut 线性拟合的区间 
*返回值:E_IO_ERROR_TABLE_OVERFLOW  数据溢出 
                   E_IO_ERROR_NONE         无错误 
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/16                              
******************************************************************/
IO_InterfaceResult_e GetTemperatureFromTable_Calibration(TableType_e ucTypeIn,int32_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    int32_t iTemperatureTemp = 0;
    /*定义变量保存从FLASH中读取的数据*/
    uint16_t usMaxValue = 0;
    uint16_t usMinVALue = 0;
    uint16_t usIndexTemp1 = 0;
    uint16_t usIndexTemp2 = 0;
    
    /*保存T型表地址
        为提高精度，这里对所有表进行标定 这里以T型表做数据进行标定*/    
    uint32_t uiTableAddress = 0x080074a4;
    /*温度值被放大了100000倍 这里缩小100000倍*/
    iTemperatureTemp = iCheckValueIn/PRECISION_MAGNIFICATION;

    if(iTemperatureTemp < gtaTableInfo[ucTypeIn].sStartTemperature || iTemperatureTemp >  gtaTableInfo[ucTypeIn].sEndTemperature )
    {
        eResult = E_IO_ERROR_TABLE_OVERFLOW;
        return eResult;
    }
    
    /*恢复成索引*/  
    /*FR3924的数据是以2摄氏度间隔存放，因此这里需要转换成INDEX,除以2*/
    usIndexTemp1 = (iTemperatureTemp -gtaTableInfo[ucTypeIn].sStartTemperature)/TEMPERATURE_INTERVAL_2;
    /*温度对应的上区间*/
    usIndexTemp2 = usIndexTemp1 + 1;
    memcpy(&usMinVALue,(void *)(uiTableAddress + (usIndexTemp1)*2),2);
    memcpy(&usMaxValue,(void *)(uiTableAddress + (usIndexTemp2)*2),2);
    /*保存温度*/
    ptLinearLinearOut->lTemperature_1 = (iTemperatureTemp/TEMPERATURE_INTERVAL_2)*TEMPERATURE_INTERVAL_2;
    /*下一个温度区间偏移2*/
    ptLinearLinearOut->lTemperature_2 = iTemperatureTemp+2;
    ptLinearLinearOut->usaLinearValue1 = usMinVALue;
    ptLinearLinearOut->usaLinearValue2 = usMaxValue;

    return E_IO_ERROR_NONE;
}



/******************************************************************
*函数名称:void SetCalibrationValueByThermocoupleType
*功能描述:设置每个通道的校准值
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/9/1                              
******************************************************************/
IO_InterfaceResult_e SetCalibrationValueByThermocoupleType(TableType_e tTypeIn)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    int64_t iTemperature = 0;
    TableLinear_t tTableLinear;

    memset(&tTableLinear,0,sizeof(tTableLinear));
    for (uint8_t i = 1; i < 8; i +=2 )
    {
        /*开始标定进来的数据为温度值放大100000值*/
        iTemperature = (int64_t)gtaAISampleInfo[i].lCalibrationValue; 

        /*通过温度查分度表 得到对应的电压*/
        eResult = GetTemperatureFromTable_Calibration(E_THERMOCOUPLE_TYPE_T,iTemperature,&tTableLinear);
        if(E_IO_ERROR_NONE != eResult)
        {
            /*数据超限  不需要进行线性拟合*/
            return eResult;
        }
        /*线性拟合  查表反向  知道温度，拟合出分度表对应的电压*/
        TableLinearFittingReverse(&tTableLinear,iTemperature,&gtaAISampleInfo[i].lCalibrationValue); 
        /*判断表的存储格式是否一致*/
        if ( tTypeIn == E_THERMOCOUPLE_TYPE_E || tTypeIn == E_THERMOCOUPLE_TYPE_J)
        {
            gtaAISampleInfo[i].lCalibrationValue = gtaAISampleInfo[i].lCalibrationValue/2;
        }
    }

    return E_IO_ERROR_NONE;
}


#endif

#if (IO_CODE_TYPE == FR3822_CODE)

/******************************************************************
*函数名称:void TemperatureOffsetCalc(TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut)
*功能描述:通过表的类型 对温度进行偏移计算
*输入参数:ucTypeIn  表格类型   ptLinearLinearInOut线性区间的地址 
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/17                              
******************************************************************/
/*改变入参  只传入INDEX  */
void TemperatureOffsetCalc(TableType_e ucTypeIn,TableLinear_t * ptLinearLinearInOut)
{
    /*对温度进行偏移*/
    ptLinearLinearInOut->lTemperature_1 = ptLinearLinearInOut->lTemperature_1 +gtaTableInfo[ucTypeIn].sStartTemperature;
    ptLinearLinearInOut->lTemperature_2 = ptLinearLinearInOut->lTemperature_2 +gtaTableInfo[ucTypeIn].sStartTemperature;
    return;
}

/******************************************************************
*函数名称:IO_InterfaceResult_e ReadTableAddress(TableType_e eSnesorTypeIn)
*功能描述: 读取固化在FLASH中的地址及表格长度
*输入参数:eSnesorTypeIn  表格类型
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/17                              
******************************************************************/
IO_InterfaceResult_e ReadTableAddress(TableType_e eSnesorTypeIn)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NONE;
    switch(eSnesorTypeIn)
    {
    case E_THERMAL_RESISTANCE_TYPE_PT1000 :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*2),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*3),FLASHADDRESSLEN);
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT200 :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*4),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*5),FLASHADDRESSLEN);
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT500 :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*6),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*7),FLASHADDRESSLEN);
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT100 :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*8),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*9),FLASHADDRESSLEN);
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_NI120 :
    {
        /*读取Index table 的起始地址*/
        memcpy(&guiTableAddress,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*10),FLASHADDRESSLEN);
        /*读取Index table 的表格长度*/
        memcpy(&guiTableLength,(void*)(TABLEHEADADDRESS+FLASHADDRESSLEN*11),FLASHADDRESSLEN);
        break;
    }
    default :
    {
        eResult = E_IO_ERROR_TABLE_TYPE;
        break;
    }
    }

    /*通道赋初值*/
    for(uint8_t i = 0; i < gucChannelCount; i++)
    {
        gusaAnalogData[i] = gtaTableInfo[eSnesorTypeIn].sEndTemperature*10;
    }
    return eResult;
}

/******************************************************************
*函数名称:void ConfigureDataByThermalResistanceType(TableType_e tTypeIn)
*功能描述:根据热电阻类型组装全局DMA_TXBUFFER
*输入参数:tTypeIn  传感器类型
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/27                              
******************************************************************/
void ConfigureDataByThermalResistanceType(TableType_e tTypeIn)
{
    /*禁能DMA*/    
    DMA_Cmd(SPI_AI_TX_DMA_CHANNEL,DISABLE);    
    DMA_Cmd(SPI_AI_RX_DMA_CHANNEL,DISABLE);
    switch(tTypeIn)
    {
    case E_THERMAL_RESISTANCE_TYPE_PT1000 :
    {
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;

        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        

        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;
        /*增益*/        
        SPI_AI_TxBuffer[9] = FSCANDPGAVALUE_9;
        SPI_AI_TxBuffer[10] =FSCANDPGAVALUE_10;
        SPI_AI_TxBuffer[11] =PGA_1_DATABAUD_160;  

        /*N极偏置*/
        SPI_AI_TxBuffer[12] = VBIASCMD;
        SPI_AI_TxBuffer[13] = WRITEBYTENUM;
        SPI_AI_TxBuffer[14] = RTD_VBIAS_VALUE_NO;

