JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
        /*配置激励源大小*/
        SPI_AI_TxBuffer[15] = ADS_WREG | ADS_IDAC0;
        SPI_AI_TxBuffer[16] = WRITEBYTENUM;
        SPI_AI_TxBuffer[17] = RTD_DRIVING_SOURCE_250; 
        
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT200 :
    {             
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;

        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        

        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;
        /*增益*/        
        SPI_AI_TxBuffer[9] = FSCANDPGAVALUE_9;
        SPI_AI_TxBuffer[10] =FSCANDPGAVALUE_10;
        SPI_AI_TxBuffer[11] =PGA_4_DATABAUD_160;

         /*N极偏置*/
        SPI_AI_TxBuffer[12] = VBIASCMD;
        SPI_AI_TxBuffer[13] = WRITEBYTENUM;
        SPI_AI_TxBuffer[14] = RTD_VBIAS_VALUE_NO;

        /*配置激励源大小*/
        SPI_AI_TxBuffer[15] = ADS_WREG | ADS_IDAC0;
        SPI_AI_TxBuffer[16] = WRITEBYTENUM;
        SPI_AI_TxBuffer[17] = RTD_DRIVING_SOURCE_250; 
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT500 :
    {           
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;

        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        

        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;
        /*增益*/        
        SPI_AI_TxBuffer[9] = FSCANDPGAVALUE_9;
        SPI_AI_TxBuffer[10] =FSCANDPGAVALUE_10;
        SPI_AI_TxBuffer[11] =PGA_1_DATABAUD_160; 

         /*N极偏置*/
        SPI_AI_TxBuffer[12] = VBIASCMD;
        SPI_AI_TxBuffer[13] = WRITEBYTENUM;
        SPI_AI_TxBuffer[14] = RTD_VBIAS_VALUE_NO;

        /*配置激励源大小*/
        SPI_AI_TxBuffer[15] = ADS_WREG | ADS_IDAC0;
        SPI_AI_TxBuffer[16] = WRITEBYTENUM;
        SPI_AI_TxBuffer[17] = RTD_DRIVING_SOURCE_250; 
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT100 :
    {          
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;

        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        

        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;
        /*增益*/        
        SPI_AI_TxBuffer[9] = FSCANDPGAVALUE_9;
        SPI_AI_TxBuffer[10] =FSCANDPGAVALUE_10;
        SPI_AI_TxBuffer[11] =PGA_4_DATABAUD_160; 

         /*N极偏置*/
        SPI_AI_TxBuffer[12] = VBIASCMD;
        SPI_AI_TxBuffer[13] = WRITEBYTENUM;
        SPI_AI_TxBuffer[14] = 0x00;

        /*配置激励源大小*/
        SPI_AI_TxBuffer[15] = ADS_WREG | ADS_IDAC0;
        SPI_AI_TxBuffer[16] = WRITEBYTENUM;
        SPI_AI_TxBuffer[17] = RTD_DRIVING_SOURCE_500; 
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_NI120 :
    {   
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;

        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        

        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;
        /*增益*/        
        SPI_AI_TxBuffer[9] = FSCANDPGAVALUE_9;
        SPI_AI_TxBuffer[10] =FSCANDPGAVALUE_10;
        SPI_AI_TxBuffer[11] =PGA_4_DATABAUD_160; 

         /*N极偏置*/
        SPI_AI_TxBuffer[12] = VBIASCMD;
        SPI_AI_TxBuffer[13] = WRITEBYTENUM;
        SPI_AI_TxBuffer[14] = RTD_VBIAS_VALUE_NO;

        /*配置激励源大小*/
        SPI_AI_TxBuffer[15] = ADS_WREG | ADS_IDAC0;
        SPI_AI_TxBuffer[16] = WRITEBYTENUM;
        SPI_AI_TxBuffer[17] = RTD_DRIVING_SOURCE_500; 
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_RESISTANCE_MEASUREMENT :
    {         
        SPI_AI_TxBuffer[0] =FSCANDPGAVALUE_0;
        SPI_AI_TxBuffer[1] =FSCANDPGAVALUE_1;        
        SPI_AI_TxBuffer[2] =FSCANDPGAVALUE_2;
        SPI_AI_TxBuffer[3] =FSCANDPGAVALUE_3;

        SPI_AI_TxBuffer[4] =FSCANDPGAVALUE_4;        
        SPI_AI_TxBuffer[5] =FSCANDPGAVALUE_5;
        SPI_AI_TxBuffer[6] =FSCANDPGAVALUE_6;
        SPI_AI_TxBuffer[7] =FSCANDPGAVALUE_7;        

        SPI_AI_TxBuffer[8] =FSCANDPGAVALUE_8;
        /*增益*/        
        SPI_AI_TxBuffer[9] = FSCANDPGAVALUE_9;
        SPI_AI_TxBuffer[10] =FSCANDPGAVALUE_10;
        SPI_AI_TxBuffer[11] =PGA_1_DATABAUD_160; 

         /*N极偏置*/
        SPI_AI_TxBuffer[12] = VBIASCMD;
        SPI_AI_TxBuffer[13] = WRITEBYTENUM;
        SPI_AI_TxBuffer[14] = RTD_VBIAS_VALUE_NO;

        /*配置激励源大小*/
        SPI_AI_TxBuffer[15] = ADS_WREG | ADS_IDAC0;
        SPI_AI_TxBuffer[16] = WRITEBYTENUM;
        SPI_AI_TxBuffer[17] = RTD_DRIVING_SOURCE_250; 
        break;
        break;
    }
    default :
    {
        break;
    }
    }

    /*配置参考REF*/
    SPI_AI_TxBuffer[18] = ADS_WREG | ADS_MUX1;
    SPI_AI_TxBuffer[19] = WRITEBYTENUM;
    SPI_AI_TxBuffer[20] = RTD_USER_CHANNEL_1_REF;

    /*配置第一个通道*/
    SPI_AI_TxBuffer[21] = ADS_WREG | ADS_MUX0;
    SPI_AI_TxBuffer[22] = WRITEBYTENUM;
    SPI_AI_TxBuffer[23] = RTD_USER_CHANNEL_1;
    
    /*设置DMA长度  配置信息长度24*/
    DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,24);   
    DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,24);

    /*使能DMA通道*/
    SendDMACmd();

    return;
}


/******************************************************************
*函数名称:
*功能描述:
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/4/29                              
******************************************************************/
void ConfigureDataToADS(uint8_t ucChannelIn)
{
    /*禁能DMA*/    
    DMA_Cmd(SPI_AI_TX_DMA_CHANNEL,DISABLE);    
    DMA_Cmd(SPI_AI_RX_DMA_CHANNEL,DISABLE);

    DMA_ClearFlag(DMA1_FLAG_GL2);    
    DMA_ClearFlag(DMA1_FLAG_GL3);

