JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
    /*根据通道组装TX BUFFER*/
    switch(ucChannelIn)
    {
    case TMEPERATURE_CHANNEL_0 :
    {  
         /*配置参考REF*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_MUX1;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTD_USER_CHANNEL_1_REF;

        /*配置1 激励源*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_IDAC1;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTD_USER_CHANNEL_1_DRIIVING_SOURCE_1;
        
        /*差分通道*/
        SPI_AI_TxBuffer[6] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[7] = WRITEBYTENUM;
        SPI_AI_TxBuffer[8] = RTD_USER_CHANNEL_1;
        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,9);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,9);       

        /*使能DMA通道*/
        SendDMACmd();
        break;
                    
    }
    case TMEPERATURE_CHANNEL_1 :
    {
        /*配置2 激励源*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_IDAC1;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTD_USER_CHANNEL_1_DRIIVING_SOURCE_2;

        /*差分通道*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTD_USER_CHANNEL_1;

        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,6);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,6);       

        /*使能DMA通道*/
        SendDMACmd();
        break;
    }
    case TMEPERATURE_CHANNEL_2 :
    {
         /*配置参考REF*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_MUX1;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTD_USER_CHANNEL_2_REF;

        /*配置1 激励源*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_IDAC1;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTD_USER_CHANNEL_2_DRIIVING_SOURCE_1;
        
        /*差分通道*/
        SPI_AI_TxBuffer[6] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[7] = WRITEBYTENUM;
        SPI_AI_TxBuffer[8] = RTD_USER_CHANNEL_2;
        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,9);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,9);       

        /*使能DMA通道*/
        SendDMACmd();
        break;

    }
    case TMEPERATURE_CHANNEL_3 :
    {  
        /*配置2 激励源*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_IDAC1;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTD_USER_CHANNEL_2_DRIIVING_SOURCE_2;

         /*差分通道*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTD_USER_CHANNEL_2;
        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,6);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,6); 

        /*使能DMA通道*/
        SendDMACmd();
        break;
    }
    case TMEPERATURE_CHANNEL_4 :
    {  
         /*配置参考REF*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_MUX1;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTD_USER_CHANNEL_1_REF;

        /*配置1 激励源*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_IDAC1;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTD_USER_CHANNEL_1_DRIIVING_SOURCE_1;
        
        /*差分通道*/
        SPI_AI_TxBuffer[6] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[7] = WRITEBYTENUM;
        SPI_AI_TxBuffer[8] = RTD_USER_CHANNEL_1_BURNOUT;
        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,9);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,9);       

        /*使能DMA通道*/
        SendDMACmd();
        break;
    }
    case TMEPERATURE_CHANNEL_5 :
    {  
         /*配置参考REF*/
        SPI_AI_TxBuffer[0] = ADS_WREG | ADS_MUX1;
        SPI_AI_TxBuffer[1] = WRITEBYTENUM;
        SPI_AI_TxBuffer[2] = RTD_USER_CHANNEL_2_REF;

        /*配置1 激励源*/
        SPI_AI_TxBuffer[3] = ADS_WREG | ADS_IDAC1;
        SPI_AI_TxBuffer[4] = WRITEBYTENUM;
        SPI_AI_TxBuffer[5] = RTD_USER_CHANNEL_2_DRIIVING_SOURCE_1;
        
        /*差分通道*/
        SPI_AI_TxBuffer[6] = ADS_WREG | ADS_MUX0;
        SPI_AI_TxBuffer[7] = WRITEBYTENUM;
        SPI_AI_TxBuffer[8] = RTD_USER_CHANNEL_2_BURNOUT;
        /*设置DMA长度  */
        DMA_SetCurrDataCounter(SPI_AI_TX_DMA_CHANNEL,9);
        DMA_SetCurrDataCounter(SPI_AI_RX_DMA_CHANNEL,9);       

        /*使能DMA通道*/
        SendDMACmd();
        break;

    }
    default :
    {
        break;
    }    
    }
    
    return;
}


/******************************************************************
*函数名称:
*功能描述:
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/4/29                              
******************************************************************/
IO_InterfaceResult_e TempConversion(TableType_e ucTypeIn, DivingSourceInfo_t *ptDivingSourceIn)
{
    /*用于保存计算RTD电阻系数*/
    int64_t llRtdResistanceCoefficient = 0;
    /*线性拟合区间*/
    TableLinear_t tTableLinear;
    /*保存计算温度值*/
    int64_t iTemperature = 0;
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;

    /*用户未断连*/
    if (ADSDISCONNECTIONVALUE !=gtaAISampleInfo[TMEPERATURE_CHANNEL_4].ulChannelDisconnectValue && ADSDISCONNECTIONVALUE_tvs != gtaAISampleInfo[TMEPERATURE_CHANNEL_4].ulChannelDisconnectValue)
    {
        /*用户1通道数据更新完成，可以更新业务数据区*/
        if(TMEPERATURE_CHANNEL_1 ==gucCurrentIndex)
        {   
            /*计算出系数并放大100000倍*/
            llRtdResistanceCoefficient = (ptDivingSourceIn->sUserChannelDivingSource_1_1 + ptDivingSourceIn->sUserChannelDivingSource_1_2)
                                          *PRECISION_MAGNIFICATION * RTD_PT100_RESISTANCE_REF>> RTD_PT100_FULL_SCALE;
            /*除以增益系数*/
            llRtdResistanceCoefficient = llRtdResistanceCoefficient/gtaTableInfo[ucTypeIn].lPGA;
            /*对传感器类型进行判断    如果是电阻类型传感器直接将电阻值显示给用户*/
            if(E_THERMAL_RESISTANCE_TYPE_RESISTANCE_MEASUREMENT == ucTypeIn)
            {
                /*判断是否超出范围*/
                if(llRtdResistanceCoefficient < gtaTableInfo[ucTypeIn].sStartTemperature*PRECISION_MAGNIFICATION || llRtdResistanceCoefficient > gtaTableInfo[ucTypeIn].sEndTemperature*PRECISION_MAGNIFICATION)
                {
                    /*更新数据区返回*/
                    gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
                    /*通道数据超出范围标记*/
                    gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_OVERFLOW;
                    return E_IO_ERROR_NONE;
                }

