JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
                /*通道状态置为连接状态*/
                gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_CONNECTION;
                /*更新业务数据区*/
                UpdateDataArea(&llRtdResistanceCoefficient);
                return E_IO_ERROR_NONE;
            }
            
            /*对阻值转换*/
            ChangeVoltageRules(ucTypeIn,&llRtdResistanceCoefficient);
            /*查表取数据*/        
            eResult = GetValueFromTable(ucTypeIn,llRtdResistanceCoefficient,&tTableLinear);
            if (E_IO_ERROR_TABLE_DATA == eResult)
            {
                /*更新数据区返回*/
                gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
                /*通道数据超出范围标记*/
                gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_OVERFLOW;
                return eResult;
            }
            
            /*线性拟合*/
            llRtdResistanceCoefficient = llRtdResistanceCoefficient/PRECISION_MAGNIFICATION;
            TableLinearFitting(&tTableLinear,llRtdResistanceCoefficient,&iTemperature);
            
            /*更新数据区  查询出来的温度直接保留一位小数显示出来*/
            UpdateDataArea(&iTemperature);  
            
            /*通道状态置为连接状态*/
            gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_CONNECTION;
            return E_IO_ERROR_NONE;
        }
    }
    else  if ( TMEPERATURE_CHANNEL_1 ==gucCurrentIndex)
    {
        /*更新数据区返回*/
        gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
        /*断连  置通道状态为断连状态*/
        gtaAISampleInfo[USER_CHANNEL_0].ucConnectionFlag = ADS_DISCONNECTION;
    }
    
    /*用户未断连*/
    if (ADSDISCONNECTIONVALUE !=gtaAISampleInfo[TMEPERATURE_CHANNEL_5].ulChannelDisconnectValue && ADSDISCONNECTIONVALUE_tvs != gtaAISampleInfo[TMEPERATURE_CHANNEL_5].ulChannelDisconnectValue)
    {
        /*用户2通道数据更新完成，可以更新业务数据区*/
        if(TMEPERATURE_CHANNEL_3 ==gucCurrentIndex)
        {
            /*计算出系数并放大100000倍*/
            llRtdResistanceCoefficient = (ptDivingSourceIn->sUserChannelDivingSource_2_1 + ptDivingSourceIn->sUserChannelDivingSource_2_2)
                                          *PRECISION_MAGNIFICATION * RTD_PT100_RESISTANCE_REF>> RTD_PT100_FULL_SCALE;
            /*除以增益系数*/
            llRtdResistanceCoefficient = llRtdResistanceCoefficient/gtaTableInfo[ucTypeIn].lPGA;

            /*对传感器类型进行判断    如果是电阻类型传感器直接将电阻值显示给用户*/
            if(E_THERMAL_RESISTANCE_TYPE_RESISTANCE_MEASUREMENT == ucTypeIn)
            {
                /*判断是否超出范围*/
                if(llRtdResistanceCoefficient < gtaTableInfo[ucTypeIn].sStartTemperature*PRECISION_MAGNIFICATION || llRtdResistanceCoefficient > gtaTableInfo[ucTypeIn].sEndTemperature*PRECISION_MAGNIFICATION)
                {
                    /*更新数据区返回*/
                    gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
                    /*通道数据超出范围标记*/
                    gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_OVERFLOW;
                    return E_IO_ERROR_NONE;
                }

                /*通道状态置为连接状态*/
                gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_CONNECTION;
                /*更新业务数据区*/
                UpdateDataArea(&llRtdResistanceCoefficient);
                return E_IO_ERROR_NONE;
            }
            
            /*对阻值转换*/
            ChangeVoltageRules(ucTypeIn,&llRtdResistanceCoefficient);
            /*查表取数据*/        
            eResult = GetValueFromTable(ucTypeIn,llRtdResistanceCoefficient,&tTableLinear);
            if(E_IO_ERROR_TABLE_DATA == eResult)
            {
                /*更新数据区返回*/
                gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
                /*通道数据超出范围标记*/
                gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_OVERFLOW;
                return eResult;
            }
            /*线性拟合*/
            llRtdResistanceCoefficient = llRtdResistanceCoefficient/PRECISION_MAGNIFICATION;
            TableLinearFitting(&tTableLinear,llRtdResistanceCoefficient,&iTemperature);
            /*更新数据区  查询出来的温度直接保留一位小数显示出来*/
            UpdateDataArea(&iTemperature);  

            /*通道状态置为连接状态*/
            gtaAISampleInfo[gucCurrentIndex/2].ucConnectionFlag = ADS_CONNECTION;
            return E_IO_ERROR_NONE;
        }
    }
    else  if ( TMEPERATURE_CHANNEL_3 ==gucCurrentIndex)/*通道断连*/
    {
        /*更新数据区返回*/
        gusaAnalogData[gucCurrentIndex/2] = gtaTableInfo[ucTypeIn].sEndTemperature*10;
        /*断连  置通道状态为断连状态*/
        gtaAISampleInfo[USER_CHANNEL_1].ucConnectionFlag = ADS_DISCONNECTION;
    }

    return E_IO_ERROR_NONE;

}
/******************************************************************
*函数名称:void ChangeVoltageRules(TableType_e ucTypeIn,int64_t* puiVoltageInOut)
*功能描述:表格类型(热电阻类型)      
*输入参数:puiVoltageInOut  转换值地址 
*输出参数:void
*返回值:无
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/3/17                              
******************************************************************/
void ChangeVoltageRules(TableType_e ucTypeIn,int64_t *plResistanceInOut)
{
    /*定义变量保存入参的值*/
    int64_t lResistanceTemp = 0;
    
    lResistanceTemp = *plResistanceInOut;
    switch(ucTypeIn)
    {
    case E_THERMAL_RESISTANCE_TYPE_PT1000 :
    {   
        /*根据规则将数据转换表格存储形式*/
        *plResistanceInOut = lResistanceTemp*RTD_PT100_TABLE_CHANGERULE;
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT200 :
    {
        /*根据规则将数据转换表格存储形式*/
        *plResistanceInOut = lResistanceTemp*RTD_PT100_TABLE_CHANGERULE;
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_PT500 :
    {   
        /*根据规则将数据转换表格存储形式*/
        *plResistanceInOut = lResistanceTemp*RTD_PT100_TABLE_CHANGERULE;
        break;
    }    
    case E_THERMAL_RESISTANCE_TYPE_PT100 :
    {        
        /*根据规则将数据转换表格存储形式*/
        *plResistanceInOut = lResistanceTemp*RTD_PT100_TABLE_CHANGERULE;
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_NI120 :
    {        
        /*根据规则将数据转换表格存储形式*/
        *plResistanceInOut = lResistanceTemp*RTD_PT100_TABLE_CHANGERULE;
        break;
    }
    case E_THERMAL_RESISTANCE_TYPE_RESISTANCE_MEASUREMENT :
    {
        /*根据规则将数据转换表格存储形式*/
        *plResistanceInOut = lResistanceTemp*RTD_PT100_TABLE_CHANGERULE;
        break;
    }

    default :
    {
        break;
    }
        }
}


/******************************************************************
*函数名称:
*功能描述:
*输入参数:
*输出参数:
*返回值:
*其它说明:
*修改日期    版本号   修改人    修改内容
*---------------------------------------------------
*2018/4/29                              
******************************************************************/
void GetDataToDivingSource(DivingSourceInfo_t *ptDivingSourceOut,int32_t uiFilterDataIn)
{
    switch(gucCurrentIndex)
    {
    case TMEPERATURE_CHANNEL_0 :
    {  
        ptDivingSourceOut->sUserChannelDivingSource_1_1 = uiFilterDataIn;
        break;
                    
