JacksonOvO/Software_VX_4208/Drivers/src/STM32FAds1248Driver.c
    }
    case TMEPERATURE_CHANNEL_1 :
    {
        ptDivingSourceOut->sUserChannelDivingSource_1_2 = uiFilterDataIn;
        break;
    }
    case TMEPERATURE_CHANNEL_2 :
    {
        ptDivingSourceOut->sUserChannelDivingSource_2_1 = uiFilterDataIn;
        break;
    }
    case TMEPERATURE_CHANNEL_3 :
    {  
        ptDivingSourceOut->sUserChannelDivingSource_2_2 = uiFilterDataIn;
        break;
    }
    default :
    {
        break;
    }    
    }    

}

/******************************************************************
*函数名称:IO_InterfaceResult_e GetValueFromTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
*功能描述:二分法查表
*输入参数:ucTypeIn 热电阻类型  iCheckValueIn 查表值 ptLinearLinearOut 线性区间地址
*输出参数:IO_InterfaceResult_e
*返回值:      E_IO_ERROR_TABLE_DATA  数据溢出
                         E_IO_ERROR_NONE          无错误 
*其它说明:
*修改日期    版本号   修改人    修改内容
                                                                  不将表格内容当成数据传入进来，直接从FLASH中读取 需要确定读取哪l表
*---------------------------------------------------
*2018/3/13                              
******************************************************************/
IO_InterfaceResult_e GetValueFromTable(TableType_e ucTypeIn,int64_t iCheckValueIn,TableLinear_t * ptLinearLinearOut)
{
    IO_InterfaceResult_e  eResult = E_IO_ERROR_NOT_BUTT;
    uint16_t usLowIndex = 0;
    /*保存二分法循环变量*/
    uint16_t  usMiddleIndex = 0;
    uint16_t usHighIndex = 0;
    /*定义变量保存从FLASH中读取的数据*/
    uint64_t ulMaxValue = 0;
    uint64_t ulMinVALue = 0;
    uint64_t usCalcTemp1 = 0;
    uint64_t usCalcTemp2 = 0;
    /*比较变量*/
    uint64_t usCompareValue = 0;
    /*定义变量保存地址*/
    uint32_t uiAddressTemp = 0;

    /*缩小100000倍  需要缩小*/
    iCheckValueIn = iCheckValueIn/PRECISION_MAGNIFICATION;
    usCompareValue = iCheckValueIn;
    usHighIndex = guiTableLength/FLASHADDRESSLEN -1;
    memcpy(&ulMinVALue,(void *)(guiTableAddress),FLASHADDRESSLEN);
    memcpy(&ulMaxValue,(void *)(guiTableAddress + (usHighIndex)*FLASHADDRESSLEN),FLASHADDRESSLEN);
    uiAddressTemp = guiTableAddress;
    
    if((usCompareValue < ulMinVALue) || (usCompareValue > ulMaxValue))
    {
        eResult = E_IO_ERROR_TABLE_DATA;
        return eResult; // 超限，不做特殊处理
    }

    while(usHighIndex >= usLowIndex)
    {
        usMiddleIndex = (usHighIndex + usLowIndex) / 2;
        
        /*mid的值有变化，重新读取对应FLASH中的地址*/
        memcpy(&usCalcTemp1,(void *)(uiAddressTemp + (usMiddleIndex)*FLASHADDRESSLEN),FLASHADDRESSLEN);

        if((usCompareValue >= usCalcTemp1) || (0 == usMiddleIndex))
        {
            /*计算Middle+1的值*/            
            memcpy(&usCalcTemp2,(void *)(uiAddressTemp + (usMiddleIndex+1)*FLASHADDRESSLEN),FLASHADDRESSLEN);
            if(usCompareValue <= usCalcTemp2)
            {
                ptLinearLinearOut->lTemperature_1 = usMiddleIndex;
                ptLinearLinearOut->lTemperature_2 = usMiddleIndex+1;
                ptLinearLinearOut->usaLinearValue1 = usCalcTemp1;
                ptLinearLinearOut->usaLinearValue2 = usCalcTemp2;
                /*对温度进行偏移*/
                TemperatureOffsetCalc(ucTypeIn,ptLinearLinearOut);
                return E_IO_ERROR_NONE;
            }
            else
            {
                usLowIndex = usMiddleIndex + 1;
            }
        }
        else if(usCompareValue < usCalcTemp1)
        {
            usHighIndex = usMiddleIndex - 1;
        }
    }
    return E_IO_ERROR_NONE;
}


#endif
#endif

